import streamlit as st
import pandas as pd
import numpy as np
import joblib
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

st.sidebar.write("<h1>เมนูเลือก</h1>",unsafe_allow_html=True)

options = ["หน้าหลัก", "ภูเก็ต", "ชลบุรี","สุราษฎร์ธานี","เชียงใหม่","สงขลา","พังงา","เชียงราย","กระบี่","ประจวบคีรีขันธ์","หนองคาย","คำนวนหารายจ่ายต่อคน"]
selected_option = st.sidebar.selectbox("\n", options)

if selected_option == "หน้าหลัก":
    travel1 = st.sidebar

    if travel1:
        st.markdown(
            f"""
                          <style>
                          .stApp {{
                              background-image: url("https://burst.shopifycdn.com/photos/misty-mountain-ranges-at-sunrise.jpg?width=1200&format=pjpg&exif=1&iptc=1");
                              background-attachment: fixed;
                              background-size: cover;
                              /* opacity: 0.3; */
                          }}
                          </style>
                          """,
            unsafe_allow_html=True)

        st.write("<h2 style='text-align: center'>รัฐบาล เปิด 10 อันดับจังหวัดที่มีรายได้จากการท่องเที่ยวสูงสุด พร้อมแนะนำสถานที่ท่องเที่ยวแต่ละจังหวัด</h2>",unsafe_allow_html=True)
        #st.write("<h3>พร้อมแนะนำสถานที่ท่องเที่ยวแต่ละจังหวัด</h3>",unsafe_allow_html=True)
        st.text('\n')
        st.text('\n')
        st.write('&nbsp;&nbsp;&nbsp; วันนี้ (15 ธ.ค.2565) น.ส.ทิพานัน ศิริชนะ รองโฆษกประจำสำนักนายกรัฐมนตรี เปิดเผยว่า ตามที่ พล.อ.ประยุทธ์ จันทร์โอชา นายกรัฐมนตรี และ รมว.กลาโหม ได้ผลักดันให้เริ่มใช้โครงการ “ภูเก็ตแซนด์บ็อกซ์” เป็นจุดเริ่มต้นตามนโยบายเปิดประเทศอย่างค่อยเป็นค่อยไป จนประสบผลสำเร็จเป็นอย่างดี ขยายออกไปยังพื้นที่อื่นๆ และนำมาสู่การเปิดประเทศอย่างเต็มรูปแบบในปัจจุบัน')

        st.text('\n')
        st.text('\n')
        st.image("https://a.cdn-hotels.com/gdcs/production17/d398/4fc00310-ba03-4511-8028-c29f05535f08.jpg",width=700)
        st.text("\n")
        st.text("\n")

        #st.write('&nbsp;&nbsp;&nbsp; วันนี้ (15 ธ.ค.2565) น.ส.ทิพานัน ศิริชนะ รองโฆษกประจำสำนักนายกรัฐมนตรี เปิดเผยว่า ตามที่ พล.อ.ประยุทธ์ จันทร์โอชา นายกรัฐมนตรี และ รมว.กลาโหม ได้ผลักดันให้เริ่มใช้โครงการ “ภูเก็ตแซนด์บ็อกซ์” เป็นจุดเริ่มต้นตามนโยบายเปิดประเทศอย่างค่อยเป็นค่อยไป จนประสบผลสำเร็จเป็นอย่างดี ขยายออกไปยังพื้นที่อื่นๆ และนำมาสู่การเปิดประเทศอย่างเต็มรูปแบบในปัจจุบัน')
        st.write('&nbsp;&nbsp;&nbsp; ผนวกกับมาตรการสาธารณสุขและความร่วมมือของคนไทย เจ้าหน้าที่ทุกภาคส่วนส่งผลให้มีการฟื้นฟูเศรษฐกิจของประเทศ โดยเฉพาะธุรกิจท่องเที่ยวที่ฟื้นตัวแบบกลับคืนมาได้อย่างรวดเร็วแบบ “V-Shape” โดยเฉพาะผลสำเร็จที่เกินความคาดหมาย จากจำนวนนักท่องเที่ยวชาวต่างชาติที่เดินทางมาท่องเที่ยวในประเทศไทย ในปี 2565 ครบ 10 ล้านคนเมื่อวันที่ 10 ธ.ค. ')
        st.write('&nbsp;&nbsp;&nbsp; น.ส.ทิพานัน กล่าวว่า การฟื้นตัวของภาคท่องเที่ยวไทยใน 10 เดือนแรกของปี 2565 ตั้งแต่เดือน ม.ค. - ต.ค.2565 ที่ผ่านมา ดึงดูดเม็ดเงินเข้าประเทศเป็นจำนวนมาก ')

if selected_option == "ภูเก็ต":
    travel2 = st.sidebar
    if travel2 :
        st.markdown(
            f"""
                                  <style>
                                  .stApp {{
                                      background-image: url("https://img.freepik.com/free-photo/white-cloud-sky-background_74190-4646.jpg");
                                      background-attachment: fixed;
                                      background-size: cover;
                                      /* opacity: 0.3; */
                                  }}
                                  </style>
                                  """,
            unsafe_allow_html=True)
        st.title('สถานที่ท่องเที่ยวใน จังหวัดภูเก็ต')
        st.header('''
        จังหวัด "ภูเก็ต" มีผู้าเข้าชมเฉี่ยต่อปี 2,329,894 คน ในปี ค.ศ.2023 และมีรายได้จากการท่องเที่ยว  127,927 ล้านบาท
        ''')
        st.text("                                                                                   ")
        st.text("1.ตึกชิโนโปรตุกีส เมืองเก่าภูเก็ต")
        st.write('&nbsp;&nbsp;&nbsp; นอกจากทะเลสวยของภูเก็ตแล้ว จุดถ่ายรูปสวยแห่งแรกที่เราอยากให้มาเช็คอินกันก็คือ เมืองเก่าภูเก็ต ไปเดินเล่นถ่ายรูปสวยๆ กับ ตึกชิโนโปรตุกีส ซึ่งเป็นการผสมผสานกันระหว่างศิลปะตะวันตกและตะวันออก เข้าไว้ด้วยกันอย่างลงตัว รวมถึงที่นี่ยังเป็นไฮไลท์ของจังหวัดภูเก็ตเลยก็ว่าได้ค่ะ เพราะมีทั้งร้านขายของที่ระลึก ร้านอาหารพื้นเมือง รวมไปถึงคาเฟ่ชิลๆ ในนั่ง เราแนะนำว่าให้เผื่อเวลาเดินชมบริเวณนี้เยอะๆ เพราะมันสวยจนถ่ายรูปไม่มีเบื่อแน่นอนจ้า')
        st.image("https://baanpuck.com/wp-content/uploads/2022/09/2022-04-21.jpg", width=700)
        st.text("                                                                                   ")
        st.text('''
        > อยู่ : ถนนดีบุก ถนนถลาง และถนนพังงา อำเภอเมืองภูเก็ต จังหวัดภูเก็ต
        > พิกัด : https://goo.gl/maps/NmesWYZPy22NrAH69
        > เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
        > โทร : -
        > เว็บไซต์ : -
        ''')
        #st.text("                                                                                   ")
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.text('2.แหลมพรหมเทพ')
        st.write('&nbsp;&nbsp;&nbsp; อีกหนึ่งที่เที่ยวในเมืองภูเก็ต ที่ห้ามพลาดเลยก็คือ แหลมพรหมเทพ บอกเลยว่าที่นี่ถูกยกให้เป็น จุดชมพระอาทิตย์ตก ที่สวยเป๋นอันดับต้นๆ ในประเทศไทยเลยทีเดียวค่ะ แนะนำให้ไปเที่ยวที่นี่ในช่วงเย็น เพื่อไปชมความสวยงามของพระอาทิตย์ตก รับลมทะเลเย็นๆ แถมบรรยากาศยังโรแมนติกอีกด้วย')
        st.image('https://lh3.googleusercontent.com/p/AF1QipPU0EqMJ5j0BzcrbcVJIJ6elTUclpbNMzEs_Uc=s1360-w1360-h1020',width=700)
        st.text('''
        ที่อยู่ : ตำบลราไวย์ อำเภอเมืองภูเก็ต จังหวัดภูเก็ต
        พิกัด : https://goo.gl/maps/LYMEfrgn1Xh6xFyD8
        เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
        โทร : -
        เว็บไซต์ : -
        ''')
        #st.text("                                                                                   ")
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.text('3.เกาะไม้ท่อน')
        st.write('&nbsp;&nbsp;&nbsp; ถ้าหากอยากจะดำน้ำหรือพักผ่อนบนเกาะสวยฟีลส่วนตัวแล้วล่ะก็ เราแนะนำให้ซื้อทัวร์ One Day Trip ไปเที่ยว เกาะไม้ท่อน ซึ่งตั้งอยู่ห่างจากภูเก็ตไปแค่ 15 นาทีเท่านั้นค่ะ เป็นเกาะสวยที่ตั้งอยู่ไม่ไกล ไปเที่ยวไม่เหนื่อย น้ำทะเลของที่นี่ใสสุดๆ เราเดินลงน้ำไปยังมองเห็นเท้าของตัวเองในน้ำเลยด้วยค่ะ แถมสามารถดำรน้ำชมปะการัง และน้องปลานีโม่ได้จากหน้าเกาะเลยทีเดียว! เป็นอีกที่เที่ยวต้องห้ามพลาดเชียวนะ!')
        st.image('https://palanla.com/ckeditor/upload/files/id37/domestic_location/Mai%20Thon%20Island/001.jpg',width=700)
        st.text('''
        ที่อยู่ : ตำบลราไวย์ อำเภอเมืองภูเก็ต จังหวัดภูเก็ต
        พิกัด : https://goo.gl/maps/px6e9zMPjtx8Phdd6
        เปิดให้เข้าชม : สามารถเที่ยวชมได้ตามรอบเรือ บริษัททัวร์นำเที่ยว
        โทร : -
        เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")

        st.text('4.จุดชมวิว ผาหินดํา')
        st.write('&nbsp;&nbsp;&nbsp; มา Unseen ภูเก็ตกันต่อที่ จุดชมวิว ผาหินดำ เป็นจุดชมวิวที่สวยอลังการสุดๆ แบบ 360 องศาสามารถมองเห็นเกาะต่างๆ โดยรอบทั้ง อ่าวฉลอง เกาะเฮ เกาะโหลน แหลมพรหมเทพ หาดยะนุ้ย จุดชมวิวกังหันลม หาดในหาน เกาะแก้วพิสดาร และเกาะไม้ท่อน ได้ครบในที่เดียวเลยค่ะ บอกเลยว่า สายถ่ายรูปต้องถูกใจ อีกทั้งยังเป็นที่เที่ยวที่คนยังไม่ค่อยรู้จักกันมากนัก ได้รูปสวยสวยๆ อันซีนแบบที่ไม่ค่อยได้เห็นแน่นอน!')
        st.image('https://baanpuck.com/wp-content/uploads/2022/12/76190325_2603881226513815_684995284542947328_n-1.jpg',width=700)
        st.text('''
        ที่อยู่ : ซอยแหลมมุมนอก ตำบลกะรน อำเภอเมืองภูเก็ต จังหวัดภูเก็ต
        พิกัด : https://goo.gl/maps/XTtq5tdGxCFQygTY6
        เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
        โทร : -
        เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")

        st.text('5.เกาะเฮ')
        st.write('&nbsp;&nbsp;&nbsp; Say Hi! เกาะเฮ เกาะที่นักเที่ยวนิยมมาเที่ยวอีกแห่งหนึ่งในภูเก็ต เพราะเป็นเกาะที่เดินทางไปไม่ยากจากตัวเมือง โดยนั่งเรือสปีดโบ๊ทเพียง 15-20 นาทีเท่านั้นก็ถึงเกาะแล้วค่ะ ที่นี่เป็นหาดทรายที่สวยงาม ทรายขาวนวล เนื้อละเอียด เดินย่ำแล้วนุ่มเท้าสุดๆ อีกทั้งยังมีน้ำทะเลใสๆ ให้เราได้เที่ยวชิล ถ่ายรูปสวยๆ นอนอาบแดด พายเรือคายัค งานนี้ บิกินี่ต้องมาแล้วจ้า!')
        st.image('http://www.egyptyha.com/wp-content/uploads/2020/05/1-1.jpg',width=700)
        st.text('''
        ที่อยู่ : ตำบลราไวย์ อำเภอเมืองภูเก็ต จังหวัดภูเก็ต
        พิกัด : https://goo.gl/maps/KAdMfSTKW1WsPxud6
        เปิดให้เข้าชม : สามารถเที่ยวชมได้ตามรอบเรือ บริษัททัวร์นำเที่ยว
        โทร : -
        เว็บไซต์ : -
        ''')
        st.text("                                                                                   ")

        st.text('6.หาดไม้ขาว')
        st.write('&nbsp;&nbsp;&nbsp; ก่อนที่จะบินกลับสู่กรุงเทพฯ เราก็ไม่อยากให้ทุกคนพลาดที่นี่! หาดไม้ขาว เพราะตั้งอยู่ติดกับสนามบินนานาชาติภูเก็ตเลยค่ะ และสิ่งที่ทุกคนต้องทำเมื่อมาเที่ยวที่นี่ก็คือ การถ่ายรูปนอนเล่นริมหาด พร้อมทั้งเซลฟี่กับเครื่องบินทั้งลำที่กำลังจะแลนด์ดิ้งนั่นเอง อะเมซซิ่ง สวยสุดๆ')
        st.image('https://sites.google.com/site/panprapa2106/_/rsrc/1479800943837/thima-khxng-khnm-hiw-phracanthr/unseenphuket017.jpg',width=700)
        st.text('''
        ที่อยู่ : อำเภอถลาง จังหวัดภูเก็ต
        พิกัด : https://goo.gl/maps/Q3E5E8rTYz3W5tVb8
        เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
        โทร : -
        เว็บไซต์ : -
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.text('7.หาดป่าตอง')
        st.write("&nbsp;&nbsp;&nbsp;  ไปภูเก็ตทั้งที จะพลาดที่นี่ได้ไง! หาดป่าตอง แลนด์มาร์คของภูเก็ตที่ใครๆ ก็ต้องมาเช็คอินสักครั้ง ไม่อย่างนั้น เหมือนไม่ได้มาเที่ยวภูเก็ตทีเดียวค่ะ หาดป่าตองถือว่าเป็นจุดรวมนักท่องเที่ยวที่เยอะที่สุดในภูเก็ตเลยก็ว่าได้ เพราะทั้งมี ที่พัก รีสอร์ท โรงแรม และร้านอาหารมากมายให้เราได้เลือก บอกเลยว่าทะเลใส หาดสวย ไปอีก ครบจบจริงๆ ค่ะ")
        st.image('https://sites.google.com/a/rk.ac.th/10-xandab-sthan-thi-thxng-theiyw-prathesthiy/_/rsrc/1451445792033/xandab-thi1/Patong-Beach9.jpg',width=700)
        st.text('''
        ที่อยู่ : ตำบลป่าตอง อำเภอกะทู้ จังหวัดภูเก็ต
        พิกัด : https://goo.gl/maps/Uof8iRsE18kLg5ip7
        เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
        โทร : -
        เว็บไซต์ : -
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.text('8.สวนน้ำอันดามันดา ภูเก็ต')
        st.write('&nbsp;&nbsp;&nbsp; สวนน้ำ อันดามันดา ภูเก็ต (Andamanda Phuket) ที่เที่ยวภูเก็ต สุดปัง ศูนย์รวมความบันเทิงครบๆ ที่เป็นมากกว่าสวนน้ำค่ะ เรียกได้ว่าเป็นที่เที่ยวมาใหม่ที่ตอบโจทย์ไลฟ์สไตล์ของนักท่องเที่ยวได้อย่างครบๆ ในธีม  “Thai Legend Meets Fantasy” ')
        st.image('https://res.klook.com/images/fl_lossy.progressive,q_65/c_fill,w_3000,h_2000,f_auto/activities/pq53swcb0pc7xfabwlhc/%E0%B8%9A%E0%B8%B1%E0%B8%95%E0%B8%A3%E0%B9%80%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%AA%E0%B8%A7%E0%B8%99%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%AD%E0%B8%B1%E0%B8%99%E0%B8%94%E0%B8%B2%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B8%94%E0%B8%B2%E0%B8%A0%E0%B8%B9%E0%B9%80%E0%B8%81%E0%B9%87%E0%B8%95(AndamandaPhuketWaterpark)-Klook%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%97%E0%B8%A8%E0%B9%84%E0%B8%97%E0%B8%A2.jpg',width=700)
        st.text('''
        ที่อยู่ : อำเภอเมืองภูเก็ต จังหวัดภูเก็ต
        พิกัด : https://goo.gl/maps/Jgfu7GRvrYAwSDf7A
        เปิดให้เข้าชม : 10.00-19.00 น.
        โทร : 0-7664-6777
        เว็บไซต์ : https://www.facebook.com/Andamandaphuket
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.text('9.หาดกล้วย')
        st.write('&nbsp;&nbsp;&nbsp; นอกจากหาดดังๆ อย่าง หาดป่าตอง แล้ว เราจะพา็กอิน หาดลับ ที่ภูเก็ตกันบ้าง ตามเรามารู้จักที่นี่เลยค่ะ หาดกล้วย หรือ Banana Beach ชายหาดที่ตั้งอยู่ระหว่าง หาดลายัน และ หาดในทอน ตั้งอยู่ในบริเวณริมเชิงเขา เงียบสงบ และน้ำทะเลก็ทั้งสวยใสมากทีเดียวค่ะ ไฮไลท์ของหาดแห่งนี้จะต่างกับหาดอื่นๆ ตรงที่ จะมีกองหินรูปร่างแปลกตาและธารน้ำจืดที่ไหลออกสู่ทะเล ทำให้เป็นจุดถ่ายรูปที่น่าสนใจมากๆ ทีเดียว ใครยังไม่เคยมา แวะมาดูกันได้เลยจ้า')
        st.image('https://www.eatchillwander.com/wp-content/uploads/2020/07/banana-beach-koh-hey-coral-island-yacht-phuket-trip14-1024x767.jpg',width=700)
        st.text('''
        ที่อยู่ : ตำบลเชิงทะเล อำเภอถลาง จังหวัดภูเก็ต
        พิกัด : https://goo.gl/maps/WYLvsS9imqkH7pYx5
        เปิดให้เข้าชม : สามารถเข้าชมได้ตลอดทั้งวัน
        โทร : -
        เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.text('10.อนุสาวรีย์ท้าวเทพกระษัตรี ท้าวศรีสุนทร')
        st.write('&nbsp;&nbsp;&nbsp; อีกหนึ่งที่ ที่เราต้องไม่พลาดแวะไปกราบสักการะกันที่ภูเก็ตก็คือ อนุสาวรีย์ท้าวเทพกระษัตรี ท้าวศรีสุนทร ค่ะ สองวีรสตรีที่ชาวภูเก็ตให้การเคารพนับถือ ที่ป้องกันเมืองถลางให้รอดพ้นจากข้าศึกได้ ในช่วงสงครามเก้าทัพ สมัยรัตนโกสินทร์ตอนต้นนั่นเอง อนุสาวรีย์ของทั้งสองท่านตั้งอยู่ที่วงเวียนสี่แยกท่าเรือ ในอำเภอถลางค่ะ เป็นอนุสาวรีย์ที่สร้างขึ้นเพื่อระลึกถึงคุณงามความดี ความกล้าหาญ และความเสียสละของวีรสตรีไทย')
        st.image('https://www.phuketdreamcompany.com/wp-content/uploads/2018/06/%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C%E0%B8%A0%E0%B8%B9%E0%B9%80%E0%B8%81%E0%B9%87%E0%B8%95-%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%A7%E0%B8%B1%E0%B8%95%E0%B8%B4%E0%B8%97%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B9%80%E0%B8%97%E0%B8%9E%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B8%A9%E0%B8%B1%E0%B8%95%E0%B8%A3%E0%B8%B5-%E0%B8%97%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B8%A8%E0%B8%A3%E0%B8%B5%E0%B8%AA%E0%B8%B8%E0%B8%99%E0%B8%97%E0%B8%A3-%E0%B8%AA%E0%B8%96%E0%B8%B2%E0%B8%99%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%97%E0%B9%88%E0%B8%AD%E0%B8%87%E0%B9%80%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A7.jpg',width=700)
        st.text('''
        ที่อยู่ : วงเวียนสี่แยกท่าเรือ ตำบลศรีสุนทร อำเภอถลาง จังหวัดภูเก็ต
        พิกัด : https://goo.gl/maps/FGUxTyHWdZMCthq98
        เปิดให้เข้าชม : 04.45-05.45 น.
        โทร : -
        เว็บไซต์ : -
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('อ้างอิงค์ https://travel.trueid.net/detail/Z9A31kEM8dZ')


if selected_option == "ชลบุรี":
    travel3 = st.sidebar
    if travel3:
        st.markdown(
            f"""
                                          <style>
                                          .stApp {{
                                              background-image: url("https://img.freepik.com/free-photo/nature-colorful-landscape-dusk-cloud_1203-5705.jpg");
                                              background-attachment: fixed;
                                              background-size: cover;
                                              /* opacity: 0.3; */
                                          }}
                                          </style>
                                          """,
            unsafe_allow_html=True)
        st.title('สถานที่ท่องเที่ยวใน จังหวัดชลบุรี')
        st.header('''
               จังหวัด "ชลบุรี" มีผู้าเข้าชมเฉี่ยต่อปี 975,026 คน ในปี ค.ศ.2023 และมีรายได้จากการท่องเที่ยว  13,283 ล้านบาท
               ''')
        st.text("                                                                                   ")
        st.text('1.น้ำตกชันตาเถร')
        st.write('&nbsp;&nbsp;&nbsp; น้ำตกชันตาเถรเป็นน้ำตกสวย ที่สำคัญยังเป็นพื้นที่ป่าผืนสุดท้ายของชลบุ อยู่ในพื้นที่ของเขตรักษาพันธุ์สัตว์ป่าเขาเขียว-เขาชมพู่ และเป็นป่าต้นน้ำของอ่างเก็บน้ำบางพระ น้ำตกชันตาเถร น้ำตกชันตาเถรที่ตั้งอยู่ในอำเภอศรีราชา ตำบลบางพระ จังหวัดชลบุรี น้ำตกชันตาเถรเป็นน้ำตกที่มี 5 ชั้นด้วยกัน แต่ชั้นที่ 4 นั้น จะสวยที่สุด ซึ่งต้องเดินเท้าประมาณ 1 กิโลเมตร ส่วนชั้นที่ 5 ต้องปีนป่ายขึ้นไป มีน้ำเฉพาะช่วงเดือนสิงหาคม-พฤศจิกายน เปิดให้เข้าเที่ยวชมระหว่างเวลา 08.00-16.00 น.')
        st.image('https://พาเที่ยวไทย.com/wp-content/uploads/2022/11/1365f710-b21c-11eb-bdb4-5dd69eff079b_original.jpg',width=700)
        st.text('''
        ที่ตั้ง:
        ถนน บ้านห้วยกุ่ม จังหวัดชลบุรี

        เวลาเปิด - ปิด:
        ทุกวัน 08.00-16.00 น.

        อัตราค่าเข้าชม:
        เด็ก 10 บาท / ผู้ใหญ่ 20 บาท
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.text('2.แหลมแท่น')
        st.write('&nbsp;&nbsp;&nbsp; แหลมแท่น ตั้งอยู่ทางทิศตะวันตกเฉียงใต้ของเขาสามมุข ปลายหาดบางแสนตอนเหนือ แหลมแท่นเป็นอีกสถานที่หนึ่งที่มีนักท่องเที่ยวนิยมมาพักผ่อน ภายในมีร้านอาหารที่มีให้เลือกรับประทานกันหลายร้าน โรงแรม เกสท์เฮ้าท์ ก็มีหลายที่ไว้คอยบริการ บริเวณแหลมแท่นเปิดให้นักท่องเที่ยวเข้ามานั่งเล่นได้ตลอด 24 ชั่วโมง')
        st.image('https://baanpuck.com/wp-content/uploads/2022/10/20171109807c81235bd7e9795e439ccd5008f571143210.jpg',width=700)
        st.text('''
        ตั้งที่อยู่:
        ต.แสนสุข อ.เมือง จ.ชลบุรี

        เวลาเปิด - ปิด:
        ตลอดเวลา
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")
        st.text('3.วิหารเทพสถิตพระกิติเฉลิม (ศาลเจ้าหน่าจาซาไท้จื้อ)')
        st.write('&nbsp;&nbsp;&nbsp; วิหารเทพสถิตพระกิติเฉลิม เป็นศาลเจ้าจีนที่ก่อสร้างอย่างสวยงาม มีชื่อเสียงมากที่สุด ที่สร้างขึ้นในรูปลักษณ์สถาปัตยกรรมจีนสูง 4 ชั้น ประกอบด้วยอาคารหลัก 3 หลัง หอฟ้าดิน 1 หลัง โดยความโดดเด่นของที่นี่คือการประดับประดาตามความเชื่อของชาวจีน เช่น รูปปั้นมังกรซึ่งมีมาถึง 2,840 ตัว กระถางธูปศักดิ์สิทธิ์ เสาฟ้าดิน นอกจากนี้ยังเป็นสถานที่ที่มีองค์ไท้ส่วยเอี้ย')
        st.image("https://thailandtourismdirectory.go.th/assets/upload/2017/11/15/20171115f74e9b4b4b26c537b9dc1da4ea6631b8100956.jpg",width=700)
        st.text('''
        ตั้งที่อยู่:
        8WHF+F88 ตำบลอ่างศิลา อำเภอเมืองชลบุรี ชลบุรี 20000 ไทย

        เวลาเปิด - ปิด:
        09:00 - 17:00
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")

        st.text('4.วัดช่องแสมสาร')
        st.write('&nbsp;&nbsp;&nbsp; วัดช่องแสมสาร หรือที่รู้จักกันใน วัดหลวงพ่อดำ อยู่บนเนินเขา ทำให้รอบ ๆ จะล้อมไปด้วยทะเล สามารถมองเห็นวิวของทะเลสัตหีบได้ทั่วทั้งบริเวณ ตั้งอยู่ในตำบลแสมสาร อำเภอสัตหีบ จังหวัดชลบุรี ทางวัดมีพระรูปท้าวมหาพรหมปางสวัสดีองค์ใหญ่ที่สุดในภาคตะวันออก ขนาดความสูง 7.80 เมตร หน้าตักกว้าง 4.99 เมตร ตั้งเด่นสูงตระหง่านอยู่ใจกลางวัด')
        st.image('https://bannkalasee.com/wp-content/uploads/2019/08/CMQ_bdrU8AIGOEO-1024x768.jpg',width=700)
        st.text('''
        ที่อยู่ :
        เลขที่ หมู่ 2 ตำบลแสมสาร อำเภอสัตหีบ จังหวัดชลบุรี 20180

        เปิดให้เข้าชม:
        ทุกวันเวลา 6.00 – 17.30 น.
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")

        st.text('5.ตลาดน้ำ 4 ภาค')
        st.write('&nbsp;&nbsp;&nbsp; ตลาดน้ำ 4 ภาคมีชื่อเสียงมาก เป็นสถานที่ท่องเที่ยวเชิงอนุรักษ์วัฒนธรรมและเป็นศูนย์รวมของ กิจกรรม ความหลากหลายเกี่ยวกับ การอนุรักษ์ศิลปวัฒนธรรม ตลาดน้ำ 4 ภาคมีร้านรวงต่าง ๆ ทั้งของกิน ของใช้ ของฝากมีให้นักท่องเที่ยวเลือกซื้อหากันมากมาย สำหรับการล่องเรือเราสามารถซื้อตั๋วตรงหน้าทางเข้าด้านหน้าหรือด้านหลังก็ได้ค่ะ ราคา 150 บาทเท่านั้น')
        st.image('https://ak-d.tripcdn.com/images/0354r120008f2jtff08FA_C_568_320_Q80.jpg',width=700)
        st.text('''
        ที่ตั้ง:
        451/304 หมู่ 12 ซอย หมู่บ้านเบเวอร์รี่ไทยเฮ้าส์ ถนน สุขุมวิทพัทยา ชลบุรี

        เวลาเปิด - ปิด:
        ทุกวัน 09:00 - 20:00 น.

        อัตราค่าเข้าชม:
        ฟรี
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")

        st.text('6.สุริยาแลนด์')
        st.write('&nbsp;&nbsp;&nbsp; สุริยาแลนด์เป็นแหล่งท่องเที่ยวที่น่าสนใจอีกแห่งหนึ่งของจังหวัดชลบุรี ตั้งอยู่ในตำบลหนองปรือ ถนนสุขุมวิทพัทยา (พัทยาใต้) ใกล้กับตลาดน้ำสี่ภาค เป็นแหล่งท่องเที่ยวที่ได้ชื่อว่ารวมของแปลกแหวกแนวของหลุดโลก')
        st.image('https://www.ipattaya.co/wp-content/uploads/2019/08/%E0%B8%AA%E0%B8%B8%E0%B8%A3%E0%B8%B4%E0%B8%A2%E0%B8%B2%E0%B9%81%E0%B8%A5%E0%B8%99%E0%B8%94%E0%B9%8C01.jpg',width=700)
        st.text('''
        ตั้งอยู่ที่:
        102/38 หมู่ 1, ถ.สุขุมวิท, ต.นาจอมเทียน, อ.สัตหีบ, จ.ชลบุรี

        เวลาเปิดปิด:
        09.00น. ถึง เวลา 21.30 น. เปิดทุกวัน  เข้าชมฟรี
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")

        st.text('7.เรือหลวงจักรีนฤเบศร')
        st.write('&nbsp;&nbsp;&nbsp; ใกล้ ๆ กันในบริเวณเกาะ มีพิพิธภัณฑ์เรือรบที่อยู่ในเขตของค่ายทหารเรือสัตหีบอยู่เหมือนกัน นั่นก็คือ เรือหลวงจักรีนฤเบศร เรือลำนี้ได้ต่อขึ้น ณ อู่ต่อเรือบาซาน เมืองโรตา ในประเทศสเปนและได้เดินทางถึงประเทศไทยเมื่อวันที่ ๙  สิงหาคม พ.ศ. ๒๕๔๐ เรือลำนี้มีทั้งหมด 11 ชั้น มีความยาว 182 เมตร กว้าง 30.5 เมตร เป็นเรือที่มียุทโธปกรณ์ที่ทันสมัย')
        st.image('https://img.wongnai.com/p/1920x0/2018/07/05/508e0166c3ea41979f012a27da6d7087.jpg',width=700)
        st.text('''
        ที่ตั้ง:
        ท่าเรือจุกเสม็ด ทางหลวงแผ่นดินหมายเลข 3 ชลบุรี

        เวลาเปิด - ปิด:
        ทุกวัน 09:00 - 16:00 น.

        อัตราค่าเข้าชม:
        ฟรี
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")

        st.text('8.ศูนย์อนุรักษ์พันธุ์เต่าทะเล')
        st.write('&nbsp;&nbsp;&nbsp; ศูนย์อนุรักษ์พันธุ์เต่าทะเลเป็นสถานที่ท่องเที่ยวเชิงอนุรักษ์ และแหล่งความรู้เกี่ยวกับเต่าทะเล ที่อยู่ในความดูแลของหน่วยบัญชาการต่อสู้อากาศยานและรักษาฝั่ง (สอ.รฝ.) อำเภอสัตหีบ ชลบุรี ซึ่งทางกองทัพเรือได้ดำเนินการอนุรักษ์เต่าทะเลมาตั้งแต่ปี พ.ศ.2493 การเข้าเยี่ยมชมภายในศูนย์อนุรักษ์พันธุ์เต่าทะเล สามารถเข้าชมได้ฟรี')
        st.image('https://www.bloggang.com/data/s/sorng/picture/1346290344.jpg',width=700)
        st.text('''
        เวลาทำการ :
        ทุกวัน ตั้งแต่เวลา 08.30 – 16.30 น.
        
        ช่วงเวลาเที่ยว :
        ตลอดทั้งปี
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")

        st.text('9.ไร่องุ่นซิลเวอร์เลค')
        st.write('&nbsp;&nbsp;&nbsp; ไร่องุ่นซิลเวอร์เลค(Silverlake Vineyard)ตั้งอยู่ในอำเภอสัตหีบ จังหวัดชลบุรี อยู่ห่างจากเมืองพัทยาเพียง 30 นาที มีพื้นที่กว่า 1,200 ไร่ ไร่องุ่นซิลเวอร์เลคมีจุดเด่นคือทิวทัศน์ที่สวยงามของทิวเขาและทะเลตะวันออกของไทย กท่องเที่ยวยังสามารถเก็บองุ่นสด ที่ไร่องุ่นซิลเวอร์เลคสามารถซื้อผลิตภัณฑ์อื่น ๆ จากองุ่น และชิมไวน์คั้นสด ๆ จากถังบ่มได้')
        st.image('https://www.thaihrhub.com/wp-content/uploads/2015/06/thaihrhub-Silverlake-%E0%B9%84%E0%B8%A3%E0%B9%88%E0%B8%AD%E0%B8%87%E0%B8%B8%E0%B9%88%E0%B8%99%E0%B8%8B%E0%B8%B4%E0%B8%A5%E0%B9%80%E0%B8%A7%E0%B8%AD%E0%B8%A3%E0%B9%8C%E0%B9%80%E0%B8%A5%E0%B8%84.jpg',width=700)
        st.text('''
        ที่ตั้ง:
        31/62 หมู่ 7 นาจอมเทียน สัตหีบ ชลบุรี 20250

        เวลาเปิด - ปิด:
        เปิดทุกวัน วันจันทร์ – วันศุกร์ ตั้งแต่เวลา 
        09.00 น. – 18.00 น. และวันเสาร์ – วันอาทิตย์
         ตั้งแต่เวลา 08.30 น. – 18.30 น
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")

        st.text('10.สวนน้ำรามายณะ')
        st.write('''
        &nbsp;&nbsp;&nbsp; สวนน้ำรามายณะตั้งอยู่ที่ตำบลนาจอมเทียน อำเภอสัตหีบ  จังหวัดชลบุรี ห่างจากตัวเมืองพัทยามาทางใต้เพียง 15 กิโลเมตร สวนนี้ตั้งอยู่รายล้อมธรรมชาติและขุนเขา บนพื้นที่กว่า 100 ไร่ ใหญ่ที่สุดในประเทศไทย ภายในสวนมีมีเครื่องเล่นสไลเดอร์ให้เล่นแบบเพลิดเพลินถึง  21 เครื่อง มีกิจกรรมและสิ่งที่น่าสนใจกว่า 50 ชนิด

        สวนน้ำรามายณะใช้น้ำที่ผ่านการกรองพิเศษ และมีไลฟ์การ์ดจำนวนมากกว่า 100 คน ซึ่งผ่านการฝึกอบรมหลักสูตรการช่วยชีวิตมาเป็นอย่างดีมาดูแลผู้ใช้บริการ
        ''')
        st.image('https://www.ticket2attraction.com/media/233388/banner.jpg',width=700)
        st.text('''
        ที่ตั้ง:
        9 หมู่ 7 ถนนบานเย็น ต.นาจอมเทียน อ.สัตหีบ จ.ชลบุรี 20250

        เวลาเปิด - ปิด :
        08:00 - 18:00
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('อ้างอิงค์ https://th.trip.com/hot/articles/%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B9%80%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A7%E0%B8%8A%E0%B8%A5%E0%B8%9A%E0%B8%B8%E0%B8%A3%E0%B8%B5.html')

if selected_option == "สุราษฎร์ธานี":
    travel4 = st.sidebar
    if travel4:
        st.markdown(
            f"""
                                                  <style>
                                                  .stApp {{
                                                      background-image: url("https://i.pinimg.com/originals/c9/b4/fb/c9b4fbc92ae7dad28793324e91028ab1.jpg");
                                                      background-attachment: fixed;
                                                      background-size: cover;
                                                      /* opacity: 0.3; */
                                                  }}
                                                  </style>
                                                  """,
            unsafe_allow_html=True)
        st.title('สถานที่ท่องเที่ยวใน สุราษฎร์ธานี')
        st.header('จังหวัด "สุราษฎร์ธานี" มีผู้าเข้าชมเฉี่ยต่อปี 606,812 คน ในปี ค.ศ.2023 และมีรายได้จากการท่องเที่ยว  7,586 ล้านบาท')

        st.write('1เกาะสมุย')
        st.write('&nbsp;&nbsp;&nbsp; เกาะสมุย เป็นเกาะขนาดใหญ่ มีชื่อเสียงโด่งดังไปทั่วโลก ตั้งอยู่ในอ่าวไทย อำเภอเกาะสมุย จังหวัดสุราษฎร์ธานี เรียกได้ว่า สวรรค์กลางอ่าวไทย อุดมสมบูรณ์ไปด้วยทรัพยากรทางธรรมชาติ ท้องทะเลสีฟ้า น้ำใสสะอาด หาดทรายทอดยาว มีแหล่งดำน้ำตื้นทางตอนใต้ของเกาะ รวมถึงน้ำตกที่มีน้ำตลอดทั้งปี มีแหล่งท่องเที่ยวมากมาย อาทิ หาดเฉวง, น้ำตกหน้าเมือง, หาดละไม, หินตาหินยาย, ศาลเจ้ากวนอู, วัดปลายแหลม, วัดละไม, วัดพระใหญ่, เจดีย์แหลมสอ เป็นต้น เกาะสมุยไปง่ายมาก มีสนามบิน มี 1 สายการบิน ที่ให้บริการคือ Bangkok Airways สามารถไปเที่ยวค้างคืนได้แบบชิวๆ ช่วงสุดสัปดาห์ เครียดๆ เบื่อเมืองหลวง หนีออกไปพักผ่อนบนเกาะ ถือเป็นความคิดที่ดีเลยนะ ช่วงเวลาที่เหมาะสมในการไปเที่ยวเกาะสมุย คือ เดือนธันวาคมถึงเดือนมิถุนายน ไม่ควรไปช่วงเดือนกันยายนถึงตุลาคม เป็นหน้ามรสุม ฝนตกหนัก แต่ราคาที่พักถูก')
        st.image('https://static.thairath.co.th/media/4DQpjUtzLUwmJZZSC5n1tz9H8gbCAUwEEhNrDrsPNBDV.jpg',width=700)
        st.text("                                                                                   ")
        st.text('''
        ที่อยู่ : อ.เกาะสมุย จ.สุราษฎร์ธานี
        เวลาทำการ : เปิดบริการทุกวัน ช่วงเวลาแนะนำ เดือนธันวาคมถึงเดือนมิถุนายน
        แผนที่ Google Map : https://goo.gl/maps/idPNRoXnueuksZUz8
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        #st.text("                                                                                   ")

        st.write('2.เกาะแตน')
        st.write('&nbsp;&nbsp;&nbsp; เกาะแตน เป็นส่วนหนึ่งของหมู่เกาะสมุย ห่างจากเกาะสมุยทางทิศใต้ 5 กิโลเมตร มีหมู่เกาะอ่างทอง อยู่ทางทิศตะวันตกเฉียงเหนือ บนเกาะปกคลุมไปด้วยป่าไม้ ป่าโกงกาง มีสัตว์ป่าอาศัยอยู่ ซึ่งถือเป็นเกาะที่มีความอุดมสมบูรณ์ ล้อมรอบไปด้วยปะการัง มีชายหาด เส้นทางศึกษาธรรมชาติ 4 เส้นทาง และจุดดำน้ำ นักท่องเที่ยวส่วนใหญ่ เดินทางมาเที่ยวชมเกาะแตน เล่นน้ำทะเล เดินเล่น ดำน้ำตื้น และอื่นๆ อย่าลืมสักการะ องค์พระทันใจ พระพุทธรูปองค์สีขาวองค์ใหญ่ สูง 7 เมตร และแวะจุดชมวิว เพื่อชมทัศนียภาพโดยรอบได้ บอกเลยว่า สวยมากกก ถึงแม้ว่าเกาะแตน จะไม่ได้รับความนิยมมากนัก แต่การมีนักท่องเที่ยวแวะเวียนเข้ามาตลอด')
        st.image('https://www.checkinchill.com/wp-content/uploads/checkinchill-9-2-2021-7.jpg',width=700)
        st.text("                                                                                   ")
        st.text('''
        ที่อยู่ : ต.ตลิ่งงาม อ.เกาะสมุย จ.สุราษฎร์ธานี, 84320
        เวลาทำการ : เปิดบริการทุกวัน
        แผนที่ Google Map : https://goo.gl/maps/cqFAKAEZuqtRrQXc9
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('3.เกาะพะงัน')
        st.write('&nbsp;&nbsp;&nbsp; เกาะพะงัน เป็นเกาะที่มีชื่อเสียงจากการจัดงานฟูลมูนปาร์ตี้ ซึ่งจัดขึ้นที่หาดริ้น ชาวต่างชาติจากทั่วทุกมุมโลกต่างก็เดินทางมาที่นี่ เป็นจุดหมายปลายทางของแบ็กแพ็คเกอร์ เกาะพะงัน ตั้งอยู่ทางทิศตะวันออกเฉียงใต้ของประเทศไทย ในจังหวัดสุราษฎร์ธานี บนเกาะมีสถานที่ท่องเที่ยวมากมาย อาทิเช่น หาดริ้น, หาดยาว, หาดแม่หาด, น้ำตกธารเสด็จ, วัดเขาถ้ำ เป็นต้น รวมถึงมีทะเลแหวก สันทรายเชื่อมไปยังเกาะม้า บริเวณหาดแม่หาดอีกด้วย การไปท่องเที่ยวที่เกาะพะงันนั้น ไม่จำเป็นต้องไปในช่วงเทศกาลฟูลมูนเท่านั้น วันอื่นๆ ก็มาเที่ยวกันได้ เพราะธรรมชาติบนเกาะ มีความสวยงามมาก เหมาะการมาพักผ่อนยิ่งนัก บนเกาะมีที่พักมากมายให้คุณได้เลือกสรร ชวนเพื่อน ชวนแฟน หรือครอบครัว ไปผ่อนคลายที่เกาะพะงันกัน !')
        st.image('https://tatapi.tourismthailand.org/tatfs/Image/CustomPOI/Picture/P03012966_1.jpeg',width=700)
        st.text("                                                                                   ")
        st.text('''
        ที่อยู่ : อ.เกาะพะงัน จ.สุราษฎร์ธานี, 84280
        เวลาทำการ : เปิดบริการทุกวัน ช่วงเวลาแนะนำ เดือนมกราคมถึงเดือนพฤษภาคม
        แผนที่ Google Map : https://goo.gl/maps/ixu5Fy1E2MZ1oSqRA
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('4.หมู่เกาะอ่างทอง')
        st.write('&nbsp;&nbsp;&nbsp; หมู่เกาะอ่างทอง ตั้งอยู่ในอ่าวไทย เขตอุทยานแห่งชาติหมู่เกาะอ่างทอง ตำบลอ่างทอง อำเภอเกาะสมุย จังหวัดสุราษฎร์ธานี ประกอบไปด้วยเกาะต่างๆ จำนวน 42 เกาะ อาทิเช่น เกาะวัวตาหลับ, เกาะแม่เกาะ, เกาะพะลวย, เกาะเชือก, เกาะสามเส้า, เกาะไผ่ลวก, เกาะนายพุด เป็นต้น ด้วยภูมิประเทศเป็นเขตน้ำตื้นใกล้ฝั่ง ทำให้น้ำทะเลไม่ค่อยใสมากเท่าไร เนื่องจากได้รับอิทธิพลจากแม่น้ำตาปี บนเกาะต่างๆ เป็นป่าไม้ผลัดใบ และภูเขาหินปูน มีความอุดมสมบูรณ์มาก และมีสัตว์นานาชนิด ทั้งบนบกและในน้ำ รวมถึง ค่างแว่นถิ่นใต้ สัตว์หายาก ที่พบได้บนเกาะวัวตาหลับ มีจุดดำน้ำตื้น สามารถดำน้ำดูปะการังได้ สถานที่น่าสนใจของหมู่เกาะอ่างทอง คือ เกาะวัวตาหลับ เป็นที่ตั้งของที่ทำการอุทยานแห่งชาติ มีชายหาด จุดชมวิว เส้นทางศึกษาธรรมชาติ ดูนก ชมกล้วยไม้รองเท้านารีช่องอ่างทอง มีที่เดียวบนเกาะวัวตาหลับ, เกาะแม่เกาะ มีทะเลใน เป็นทะเลสาบสีเขียวใจกลางเกาะ ล้อมรอบด้วยภูเขา มีจุดชมวิว สามารถเห็นทัศนียภาพมุมสูงได้อย่างงดงาม, เกาะสามเส้า อยู่ตรงข้ามเกาะแม่เกาะ มีปะการังและดอกไม้ทะเลสวยงาม มีสะพานหินธรรมชาติยื่นออกไปในทะเล, เกาะหินดับ มีหากทรายสวยงามและยาวที่สุดในอุทยาน, เกาะท้ายเพลา-เกาสะวัวกันตัง เป็นจุดที่มีแนวปะการังที่สวยที่สุดหนึ่งแห่งเลยล่ะ มีค่าเข้าอุทยาน 40 บาท')
        st.image('https://img.kapook.com/u/2022/sutasinee/02/40_1.jpg',width=700)
        st.text("                                                                                   ")
        st.text('''
        ที่อยู่ : ต.อ่างทอง อ.เกาะสมุย จ.สุราษฎร์ธานี, 84140
        เวลาทำการ : เปิดบริการ วันที่ 16 ธันวาคม – วันที่ 31 ตุลาคม
        แผนที่ Google Map : https://g.page/mukoangthongnationalmarinepark?share
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('5.เกาะเต่า')
        st.write('&nbsp;&nbsp;&nbsp; เกาะเต่า เป็นอีกหนึ่งสถานที่ท่องเที่ยวยอดนิยมของทั้งชาวไทยและชาวต่างชาติ ตั้งอยู่ในอำเภอเกาะพะงัน จังหวัดสุราษฎร์ธานี ขึ้นชื่อในเรื่องของความอุดมสมบูรณ์ทางธรรมชาติ น้ำทะเลสีฟ้าคราม สัตว์น้ำ และปะการังมากมาย ใกล้เคียงมีเกาะเล็กๆ คือ เกาะนางยวน มีสันทรายเชื่อมต่อกับเกาะเต่า ที่เรารู้จักกันดีว่า ทะเลแหวก จนเกิดเป็นความมหัศจรรย์ ดึงดูดนักท่องเที่ยวเข้ามาอย่างไม่ขาดสาย แถมยังเป็นแหล่งดำน้ำดูปะการัง ซึ่งเป็นกิจกรรมหลักๆ ของผู้มาเยือน ที่ได้ชมความสวยงามใต้ท้องทะเล สถานที่ท่องเที่ยวบนเกาะเต่า มีเพียบ อาทิ อ่าวฉลาม หาดทรายรี สวนหิน จปร. แหลมเทียน จุดชมวิวเขาจอห์น-สุวรรณ อ่าวจันทร์สม เป็นต้น อีกทั้งบนเกาะมีที่พักมากมาย ทั้งโรงแรม รีสอร์ท และวิลล่าส่วนตัว ตั้งแต่ราคาเบาๆ ไปจนถึงราคาสูง ให้คุณได้พักผ่อนไปกับธรรมชาติที่งดงาม')
        st.image('https://www.kohtaocompleteguide.com/wp-content/uploads/2018/04/DJI_0175-koh-tao-thai.jpg',width=700)
        st.text("                                                                                   ")
        st.text('''
        ที่อยู่ : ต.อ่าวนาง อ.เกาะสมุย จ.สุราษฎร์ธานี, 84320
        เวลาทำการ : เปิดบริการทุกวัน ช่วงเวลาแนะนำ เดือนมกราคมถึงเดือนพฤษภาคม
        แผนที่ Google Map : https://goo.gl/maps/9hK1aHxqt152LVQFA
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('6.เกาะนางยวน')
        st.write('&nbsp;&nbsp;&nbsp; เกาะนางยวน เป็นเกาะเล็กๆ ใกล้เคียงกับเกาะเต่า ตั้งอยู่ทางทิศตะวันตกเฉียงเหนือของเกาะเต่า ห่างกันประมาณ 480 เมตร โดยเกาะนางยวนประกอบด้วยเกาะขนาดเล็ก 3 เกาะ ซึ่งเชื่อมต่อกันด้วยสันทราย เกิดเป็นทะเลแหวก (เห็นชัดเวลาน้ำลง) จนเกิดเป็นความสวยงาม ดึงดูดนักท่องเที่ยวได้มากมาย  บรรยากาศดี เงียบสงบ บนเกาะปกคลุมไปด้วยป่าสีเขียวและหิน อีกทั้งยังเป็นแหล่งดำน้ำ ดูปะการัง ที่สวยงามอีกหนึ่งแห่ง เพราะเป็นเกาะที่มีปะการังสมบูรณ์ โดยเฉพาะสวนญี่ปุ่น จุดดำน้ำลึก มีปะการังและสัตว์น้ำแหวกว่าย เสมือนสวนญี่ปุ่นใต้น้ำ นักดำน้ำต่างก็แวะเวียนมาบ่อยครั้ง อีกทั้งบนเกาะยังมีจุดชมวิว เมื่อขึ้นไปแล้ว เราจะได้ทัศนียภาพอันงดงาม เห็นหาดทรายเชื่อมต่อกันทั้ง 3 เกาะ มีค่าธรรมเนียมขึ้นเกาะ คนไทย 30 บาท ชาวต่างชาติ 100 บาท')
        st.image('http://baagklong.com/wp-content/uploads/2020/03/12764415_1728114877402123_2200180628554666649_o.jpg',width=700)
        st.text("                                                                                   ")
        st.text('''
        ที่อยู่ : ต.อ่าวนาง อ.เกาะสมุย จ.สุราษฎร์ธานี, 84360
        เวลาทำการ : เปิดบริการทุกวัน ช่วงเวลาแนะนำ เดือนกุมภาพันธ์ถึงเดือนกันยายน
        แผนที่ Google Map : https://goo.gl/maps/GS3jiHSxcsBZ8Xik6
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('7.เขื่อนรัชชประภา')
        st.write('&nbsp;&nbsp;&nbsp; เขื่อนรัชชประภา เดิมเรียกว่า เขื่อนเชี่ยวหลาน ตั้งอยู่ในตำบลเขาพัง อำเภอบ้านตาขุน จังหวัดสุราษฎร์ธานี เป็นเขื่อนอเนกประสงค์แห่งที่สองของภาคใต้ โดยเป็นเขื่อนหินถมแกนดินเหนียว สร้างปิดกั้นลำน้ำคลองแสง สูง 94 เมตร สันเขื่อนยาว 761 เมตร พื้นที่ส่วนใหญ่ของเขื่อนติดอุทยานแห่งชาติเขาสกเกือบทั้งหมด ทัศนียภาพโดยรอบของเขื่อนสวยงามมาก น้ำใสสีมรกต มองเห็นตัวปลา ภูเขาหินปูนสูงโผล่พ้นน้ำมากมาย มีหมอกคละคลุงจางๆ และชะแง่นผาบวกกับผืนน้ำ จนเกิดเป็นภาพความงดงาม สมกับฉายา กุ้ยหลินเมืองไทย ถือเป็นสถานที่ที่ไม่ควรพลาดเมื่อมาเที่ยวจังหวัดสุราษฎร์เลยนะ อีกทั้งภายในยังมีแพริมน้ำหลายเจ้า ให้คนที่สนใจอยากจะค้างแรมในบรรยากาศธรรมชาติ มีกิจกรรมให้ทำเพียบ อาทิ ล่องเรือ ดูถ้ำปะการัง เล่นน้ำ พายเรือคายัค เป็นต้น สัญญาณมือถือแทบไม่มี เลย มาพักผ่อนที่นี่ คือ ได้ผ่อนคลายท่ามกลางธรรมชาติอย่างแท้จริง')
        st.image('https://www.egat.co.th/home/wp-content/uploads/2021/03/DJI_0044-scaled.jpg',width=700)
        st.text("                                                                                   ")
        st.text('''
        ที่อยู่ : ต.เขาพัง อ.บ้านตาขุน จ.สุราษฎร์ธานี, 84230
        เวลาทำการ : เปิดบริการทุกวัน
        แผนที่ Google Map : https://goo.gl/maps/RL482er2UDDrkoFMA
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('8.ป่าต้นน้ำบ้านน้ำราด')
        st.write('&nbsp;&nbsp;&nbsp; ป่าต้นน้ำบ้านน้ำราด สถานที่ท่องที่ยวทางธรรมชาติ ในบ้านน้ำราด ตำบลบ้านทำเนียบ อำเภอคีรีรัฐนิคม จังหวัดสุราษฎร์ธานี เป็นบ่อน้ำที่ผุดขึ้นจากผืนดิน น้ำใสมาก มองเห็นพื้นทรายด้านล่าง ความลึกประมาณ 1 เมตร รายล้อมไปด้วยป่าไม้สีเขียวที่มีความอุดมสมบูรณ์ บรรยากาศร่มรื่น ธรรมชาติสุดๆ สามารถลงเล่นน้ำคลายร้อนได้ มีเรือคายัคให้พาย (มีค่าบริการต่างหาก) ค่าเข้าชม ผู้ใหญ่ (อายุ 16 ขึ้นไป) 25 บาท เด็กอายุไม่เกิน 15 ปี 15 บาท โดยน้ำที่ผุดขึ้นมาจะไหลไปสู่น้ำตกธารทอง ชาวบ้านมีการกั้นบ่อน้ำ มีทั้งส่วนที่ลงเล่นได้กับลงเล่นไม่ได้ อีกทั้งที่นี่มีกฎระเบียบ-ข้อห้าม ขอให้นักท่องเที่ยวช่วยกันปฏิบัติตามกฎด้วยนะคะ เพื่อความงดงามของธรรมชาติ ให้คนอื่นๆ ได้มาเที่ยวต่อไป')
        st.image('https://fridayvacation.com//pic/158/7.jpg',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : ต.บ้านทำเนียบ อ.คีรีรัฐนิคม จ.สุราษฎร์ธานี, 84180
        เวลาทำการ : เปิดบริการทุกวัน 08.00 – 17.00 น.
        แผนที่ Google Map : https://goo.gl/maps/qJ5WDaNSrsq3sWNv5
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('9.อุโมงค์ต้นจาก คลองร้อยสาย')
        st.write('&nbsp;&nbsp;&nbsp; พลาดไม่ได้ กับการนั่งเรือแจว ลอดอุโมงค์ต้นจาก ในคลองร้อยสาย ถือเป็นเสน่ห์อย่างหนึ่งของชุมชนบางใบไม้ สถานที่ท่องเที่ยวเชิงอนุรักษ์ ในตำบลบางใบไม้ อำเภอเมือง จังหวัดสุราษฎร์ธานี ชุมชนริมน้ำ ที่จะทำให้คุณได้สัมผัสวิธีชีวิตริมคลอง ชาวบ้านที่นี่ส่วนใหญ่ประกอบอาชีพทำสวนมะพร้าว และทำประมง คลองร้ายสาย ชื่อนี้มาจากคลองเล็กคลองน้อยนับร้อยสายเชื่อมต่อกันถึง 6 ตำบล และไหลลงสู่แม่น้ำตาปี ทุกวันอาทิตย์ จะมีตลาดน้ำประชารัฐบางใบไม้ เป็นตลาดริมคลอง มีพื้นที่นั่งพักผ่อน ให้คนในพื้นที่และนักท่องเที่ยวต่างมาเดินเที่ยว ช็อปปิ้ง หาของกิน มีทั้งอาหารคาว อาหารหวาน และผลผลิตจากชาวบ้านตามฤดูกาล ไฮไลท์สำคัญ คือ การนั่งเรือลอดอุโมงค์ต้นจาก โดยคุณลุงจะแจวเรือแบบช้าๆ เพื่อให้เราได้ดื่มด่ำไปกับบรรยากาศ สองฝั่งคลองที่มีต้นจากและต้นมะพร้าวโค้งเข้าหากัน โดยเรือนั่งได้ 5 คน ค่าใช้จ่ายคนละ 100 บาท ใช้เวลาล่องเรือประมาณ 1-2 ชั่วโมง')
        st.image('https://www.thebangkokinsight.com/wp-content/uploads/2020/09/%E0%B8%AD%E0%B8%B8%E0%B9%82%E0%B8%A1%E0%B8%87%E0%B8%84%E0%B9%8C-%E0%B8%95%E0%B9%89%E0%B8%99%E0%B8%88%E0%B8%B2%E0%B8%813-700x476.jpg',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : ต.บางใบไม้ อ.เมือง จ.สุราษฎร์ธานี, 84000
        เวลาทำการ : เปิดบริการทุกวันอาทิตย์ เวลา 09.00 – 17.00 น.
        แผนที่ Google Map : https://goo.gl/maps/E9w3akuTypuaQ72H9
        ''')

        st.write('10.วัดพระบรมธาตุไชยาราชวรวิหาร')
        st.write('&nbsp;&nbsp;&nbsp; อีกหนึ่งสถานที่ที่พลาดไม่ได้ คือ วัดพระบรมธาตุไชยาราชวรวิหาร ตั้งอยู่บนถนนรักษ์นรกิจ ตำบลเวียง อำเภอไชยา จังหวัดสุราษฎร์ธานี เป็นพระอารามหลวงชั้นเอก จัดเป็นโบราณสถาน สร้างขึ้นในสมัยศรีวิชัย โดดเด่นด้วยพระบรมธาตุไชยา ภายในบรรจุพระบรมสารีริกธาตุของสมเด็จพระสัมมาสัมพุทธเจ้า มีความสูงราวๆ 24 เมตร รอบองค์พระธาตุมีเจดีย์เล็ก 4 ทิศ ล้อมรอบด้วยวิหารคด ซึ่งประดิษฐานพระพุทธรูปเก่าแก่ขนาดต่าง ๆ โดยรอบ เป็นวัดเก่าแก่คู่บ้านคู่เมืองของจังหวัดสุราษฎร์ธานี และเป็น 1 ใน 3 โบราณสถานอันศักดิ์สิทธิ์ที่เคารพบูชาของภาคใต้ (เจดีย์พระมหาธาตุ วัดพระมหาธาตุวรมหาวิหาร จังหวัดนครศรีธรรมราช, พระพุทธไสยาสน์ในถ้ำคูหาภิมุข บริเวณวัดคูหาภิมุข จังหวัดยะลา และพระบรมธาตุไชยา จังหวัดสุราษฎร์ธานี) นักท่องเที่ยวนิยมมาสักการะบูชา-ขอพร เพื่อความเป็นสิริมงคล และเดินเที่ยวชมความสวยงามของวัด')
        st.image('https://sites.google.com/site/samartponza/_/rsrc/1408094379881/canghwad-1/wad-phrabrm-thatu-chiya-rachwrwihar/image-201406071555500.jpg',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : 50 หมู่ 3 ถนนรักษ์นรกิจ ต.เวียง อ.ไชยา จ.สุราษฎร์ธานี, 84110
        เวลาทำการ : เปิดบริการทุกวัน
        แผนที่ Google Map : https://goo.gl/maps/FEAGTcAs8PUsvSgu7
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('อ้างอิงค์ https://travel.trueid.net/detail/Ov7w7Qo105Y')

if selected_option == "เชียงใหม่":
    travel5 = st.sidebar
    if travel5:
        st.markdown(
            f"""
                                                          <style>
                                                          .stApp {{
                                                              background-image: url("https://www.creativefabrica.com/wp-content/uploads/2020/02/13/Cyan-Abstract-Background-Graphics-1.jpg");
                                                              background-attachment: fixed;
                                                              background-size: cover;
                                                              /* opacity: 0.3; */
                                                          }}
                                                          </style>
                                                          """,
            unsafe_allow_html=True)
        st.title('สถานที่ท่องเที่วยใน เชียงใหม่')
        st.header('จังงหวัด "เชียงใหม่" มีผู้าเข้าชมเฉี่ยต่อปี 496,111 คน ในปี ค.ศ.2023 และมีรายได้จากการท่องเที่ยว  4,246 ล้านบาท')
        st.write('1.วัดพระธาตุดอยสุเทพ')
        st.write('&nbsp;&nbsp;&nbsp; ใครที่ไปเที่ยวเชียงใหม่แล้วไม่ได้ไป วัดพระธาตุดอยสุเทพ ถือว่าไปไม่ถึงเชียงใหม่ เลยทีเดียวค่ะ เพราะ วัดพระธาตุดอยสุเทพนั้นเป็นปูชนียสถานคู่เมืองเชียงใหม่มาตั้งแต่โบราณ ตั้งอยู่บนยอดดอยสุเทพ  นอกจากนี้ยังมี บันไดนาคเจ็ดเศียร ซึ่งทอดยาวขึ้นไป 300 ขั้น และ เจดีย์สีทองทรงเชียงแสน เป็นศิลปะล้านนาที่งดงาม อีกทั้งที่นี่เป็นพระธาตุประจำคนเกิดปีมะแมตามคติความเชื่อล้านนาอีกด้วยค่ะ')
        st.image('https://img.wongnai.com/p/1920x0/2018/08/20/741af8955f1c4ea0956227a7ee1cec16.jpg',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : 9 หมู่ที่ 9 อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่
        พิกัด : https://goo.gl/maps/GaQvPUsra8vhQ61T6
        เปิดให้เข้าชม : 06.00-20.00 น.
        โทร : -
        เว็บไซต์ : https://www.facebook.com/วัดพระธาตุดอยสุเทพ
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('2.ดอยอินทนนท์')
        st.write('&nbsp;&nbsp;&nbsp; ดอยอินทนนท์ ถือเป็นภูเขาที่สูงที่จะในประเทศไทย ด้วยความสูงจากระดับน้ำทะเล 2,565 เมตรค่ะ จึงทำให้มีสภาพอากาศที่เย็นตลอดทั้งปี')
        st.write('&nbsp;&nbsp;&nbsp; นักท่องเที่ยวนิยมขึ้นไปบนดอยอินทนนท์ เพื่อเดินชมป่าดิบเขาที่เต็มไปด้วยต้นไม้สูงใหญ่ มอสและเฟิร์นสีเขียว บริเวณ อ่างกาหลวง สัมผัสความสดชื่นจากธรรมชาติ แวะถ่ายรูปที่จุดสูงสุดบนยอดดอย และสักการะ พระมหาธาตุนภเมทนีดล และพระมหาธาตุนภพลภูมิสิริ อันสวยงามท่ามกลางทิวเขา')
        st.image('https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Naphamethinidon%2C_Naphaphonphumisiri_near_summit_of_Doi_Inthanon.jpg/1200px-Naphamethinidon%2C_Naphaphonphumisiri_near_summit_of_Doi_Inthanon.jpg',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : ตำบลบ้านหลวง อำเภอจอมทอง จังหวัดเชียงใหม่
        พิกัด : https://goo.gl/maps/cKw5qsGsTaSDtRqS8
        เปิดให้เข้าชม :  05.00-18.00 น.
        โทร : อุทยานแห่งชาติดอยอินทนนท์ 0-5328-6729
        เว็บไซต์ : https://www.facebook.com/DoiInthanonNationalPark
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('3.ประตูท่าแพ')
        st.write('&nbsp;&nbsp;&nbsp; แลนด์มาร์กอีกหนึ่งแห่งของเชียงใหม่ ที่ใครก็ต้องแวะไปถ่ายรูปชิคๆ เช็คอินว่ามาถึงเชียงใหม่แล้วจริงๆ นะ ก็คือที่นี่ ประตูท่าแพ ค่ะ ประตูท่าแพ เป็นประตูเมืองที่อยู่ทางด้านทิศตะวันออกของเมืองเชียงใหม่ชั้นใน ซึ่งก็คือพื้นที่สี่เหลี่ยมที่ล้อมรอบด้วยคูเมืองนั่นเอง บริเวณประตูท่าแพจะเห็นแนวกำแพงเมืองเก่าซึ่งสร้างด้วยอิฐ มีความสวยงาม และเป็นเอกลักษณ์ บริเวณประตูท่าแพมีลานกว้างซึ่งใช้จัดงานเทศกาลต่างๆ และยังเป็นจุดเริ่มต้นของ ถนนคนเดินท่าแพ ซึ่งจัดขึ้นทุกๆ วันอาทิตย์อีกด้วย')
        st.image('https://mateawthai.com/wp-content/uploads/2022/05/Hostory-Tha-Phae-Gate.jpg',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : ถนนท่าแพ ตำบลช้างคลาน อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่
        พิกัด : https://goo.gl/maps/d28E1P8hTEAKnHfH9
        เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
        โทร : -
        เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('4.ถนนคนเดินท่าแพ')
        st.write('&nbsp;&nbsp;&nbsp; จัดทริปไปเที่ยวเชียงใหม่ทั้งที ห้ามพลาดการไปเดิน ถนนคนเดินเชียงใหม่ โดยเฉพาะ ถนนคนเดินท่าแพ ที่จัดขึ้นทุกวันอาทิตย์ โดยจะปิดถนนตั้งแต่ประตูท่าแพไปยังถนนราชดำเนิน สามารถไปเดินกันได้ตั้งแต่เวลา 18.00 น. เป็นต้นไปค่ะ')
        st.write('&nbsp;&nbsp;&nbsp; ตลอดเส้นทางถนนคนเดินจะมีร้านค้ามากมาย ทั้งร้านอาหารที่มีทั้งอาหารทั่วไปและอาหารพื้นเมืองอร่อยๆ ขาย ร้านขายเสื้อผ้า ร้านขายสินค้าพื้นเมือง ร้านขายของที่ระลึกเก๋ๆ ไม่เหมือนใคร ให้ได้เดินเลือกอิ่มเลือกช้อปปิ้งกันแบบชิลๆ')
        st.image('https://img.kapook.com/u/rungtip/1yying/20130828042405.jpg',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : ถนนราชดำเนิน ตำบลศรีภูมิ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่
        พิกัด : https://goo.gl/maps/zZa4q5Z5uVhpcwd96
        เปิดให้เข้าชม : เฉพาะวันอาทิตย์ 18.00-22.00 น
        โทร : -
        เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('5.ถนนนิมมานเหมินทร์')
        st.write('&nbsp;&nbsp;&nbsp; นิมมานเหมินทร์ ถนนเส้นนี้คงไม่มีใครไม่รู้จัก เพราะเป็นถนนชื่อดังของเชียงใหม่ที่เป็นแหล่งรวมร้านค้า ร้านอาหารหลากหลายสไตล์ คาเฟ่เก๋ๆ และเต็มไปด้วยความคึกคัก')
        st.write('&nbsp;&nbsp;&nbsp; อย่างถนนนิมมานเหมินทร์ ซอย 1 เป็นถนนที่คงเอกลักษณ์ของผู้คนและศิลปวัฒนธรรมของชาวล้านนาไว้ มีร้านแกลเลอรี่ ร้านขายของตกแต่งบ้าน นิมมานเหมินทร์ ซอย 9 เป็นถนนสายกาแฟ เต็มไปด้วยร้านกาแฟชื่อดัง เหมาะสำหรับคอกาแฟและสายชิลไปนั่งเล่น สาย Cafe Hopping ต้องเลิฟที่นี่มากแน่นอนค่ะ')
        st.image('https://s.isanook.com/tr/0/rp/r/w728/ya0xa0m1w0/aHR0cHM6Ly9zLmlzYW5vb2suY29tL3RyLzAvdWQvMjg0LzE0MjI5NDcvMS03Njh4NTUzLmpwZw==.jpg',width=700)
        st.text('\n')
        st.text('''
        อยู่ : ถนนนิมมานเหมินทร์ ตำบลสุเทพ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่
        พิกัด : https://goo.gl/maps/4igTAWKtwfDtHjYw5
        เปิดให้เข้าชม : เวลาเปิด-ปิด แตกต่างกันไปในแต่ละร้านค้า
        โทร : -
        เว็บไซต์ : -
    
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('6.ม่อนแจ่ม')
        st.write('&nbsp;&nbsp;&nbsp; ม่อนแจ่ม เป็นที่เที่ยวยอดฮิตที่ใครก็พลาดไม่ได้ เพราะมีอากาศเย็นสบายตลอดทั้งปี ใช้เวลาเดินทางจากตัวเมืองเชียงใหม่ประมาณ 40 นาทีเท่านั้น ก็จะได้ชมวิวทิวทัศน์ของภูเขาสลับซับซ้อนสวยงามของอำเภอแม่ริม ได้อย่างสุดสายตา')
        st.write('&nbsp;&nbsp;&nbsp; หากไปเที่ยวตอนเช้าจะได้เห็นหมอกสีขาวที่ปกคลุมอยู่ทั่วบริเวณ ห้ามพลาดการถ่ายรูปกับดอกเวอร์บีน่าสีม่วงที่ชูช่อสวยงาม เยี่ยมชมหมู่บ้านหนองหอยและพื้นที่โครงการหลวงที่ปลูกและวิจัยพืชผักเมืองหนาว ใครยังไม่เต็มอิ่ม บนเขายังมีที่พักและรีสอร์ทเปิดให้บริการมากมายให้ได้สัมผัสธรรมชาติอย่างใกล้ชิด')
        st.image('https://พาเที่ยวไทย.com/wp-content/uploads/2022/01/checkinchill-20-7-2020-171-1170x658.png',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : ตำบลแม่แรม อำเภอแม่ริม จังหวัดเชียงใหม่
        พิกัด : https://goo.gl/maps/RL1LZpaLWGMqS4oHA
        เปิดให้เข้าชม : 06.00-18.00 น.
        โทร : -
        เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('7.แกรนด์แคนยอน หางดง')
        st.write('&nbsp;&nbsp;&nbsp; เที่ยวแบบแอดเวนเจอร์เบาๆ กันที่ แกรนด์แคนยอน เชียงใหม่ ที่ อำเภอหางดง จริงๆ แล้วที่ตรงนี้เคยเป็นบ่อดินที่เจ้าของขุดดินไปขาย เมื่อบ่อเหล่านี้กลายเป็นบ่อน้ำทำให้เกิดความสวยงามคล้ายแกรนด์แคนยอน กลายเป็นแหล่งท่องเที่ยวแห่งใหม่ สวนน้ำที่ใครไปเที่ยวเชียงใหม่ก็ต้องไม่พลาดค่ะ')
        st.write('&nbsp;&nbsp;&nbsp; นอกจากถ่ายรูปสวยๆ แล้ว ที่นี่เหมาะมากสำหรับสายแอดเวนเจอร์ เพราะมีบริการเช่าเรือ เช่าห่วงยาง สำหรับเล่นน้ำในสระ เป็นที่คลายร้อนเหมาะกับอากาศเมืองไทยจริงๆ')
        st.image('https://reviewchiangmai.com/wp-content/uploads/2018/10/44157638_2171180403144398_8276919394102149120_n.jpg',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : 202 หมู่ 3 ถนนเลียบคลองชลประทาน ตำบลน้ำแพร่ อำเภอหางดง จังหวัดเชียงใหม่
        พิกัด : https://goo.gl/maps/GhSy9Z6xEfNHg9Et5
        เปิดให้เข้าชม : 10.00-18.00 น.
        โทร : 06-3672-4007
        เว็บไซต์ : https://www.facebook.com/Grandcanyonwaterpark
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('8.สวนพฤกษศาสตร์สมเด็จพระนางเจ้าสิริกิติ์')
        st.write('&nbsp;&nbsp;&nbsp; สวนพฤกษศาสตร์สมเด็จพระนางเจ้าสิริกิติ์ อำเภอแม่ริม เป็นอีกหนึ่งที่เที่ยวยอดฮิตสำหรับคนรักธรรมชาติ ภายในมีนิทรรศการเกี่ยวกับพรรณไม้ไทย เรือนกระจกขนาดใหญ่ ซึ่งรวบรวมพรรณไม้ในเขตป่าดงดิบ จากทั่วทุกภูมิภาคของทวีปเอเชียมาจัดแสดง เสมือนว่าได้เข้าไปอยู่ในป่าจริงๆ')
        st.write('&nbsp;&nbsp;&nbsp; นอกจากนี้ยังมีเรือนพืชทะเลทราย พรรณไม้น้ำ เฟิร์น กล้วยไม้ไทย เป็นต้น อีกสิ่งที่ห้ามพลาดเมื่อไปเที่ยวสวนพฤกษศาสตร์สมเด็จพระนางเจ้าสิริกิติ์คือ Canopy Walkway หรือทางเดินลอยฟ้า ซึ่งเป็นเส้นทางชมธรรมชาติเหนือเรือนยอดไม้ที่ยาวที่สุดในประเทศไทย')
        st.image('https://cbtthailand.dasta.or.th/upload-file-api/Resources/RelateAttraction/Images/RAT500182/1.jpeg',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : 100 หมู่ 9 ตำบลแม่แรม อำเภอแม่ริม จังหวัดเชียงใหม่
        พิกัด : https://goo.gl/maps/GpoX36TWX38o5wDZ6
        เปิดให้เข้าชม : 08.30-16.30 น.
        โทร : 0-5384-1234
        เว็บไซต์ : https://www.facebook.com/qsbgcm
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('9.วัดอุโมงค์')
        st.write('&nbsp;&nbsp;&nbsp; วัดอุโมงค์ เป็นวัดเก่าแก่อยู่คู่เมืองเชียงใหม่มากว่า 700 ปีเลยทีเดียว มีเอกลักษณ์สำคัญคือ อุโมงค์ ซึ่งสร้างในสมัยพญากือนาเพื่อถวายให้พระมหาเถรจันทร์ ผู้เชี่ยวชาญในพระไตรปิฎกใช้เป็นที่วิปัสสากรรมฐานค่ะ ที่นี่จึงเป็นจุดที่นักท่องเที่ยวมักมาเดินชมความสวยงามภายในอุโมงค์ของที่วัด ')
        st.write('&nbsp;&nbsp;&nbsp; ภายในอุโมงค์สามารถเดินทะลุถึงกัน มีช่องสำหรับจุดเทียนให้แสงสว่าง สะดวกแก่พระเดินจงกรมและปฏิบัติธรรม ด้านบนอุโมงค์เป็นเจดีย์ทรงระฆังกลม ด้านหลังวัดเป็นสวนพุทธธรรมเงียบสงบร่มรื่นและสระน้ำใหญ่เป็นเขตอภัยทาน สามารถให้อาหารปลาและดูนกได้อีกด้วย')
        st.image('https://static.thairath.co.th/media/4DQpjUtzLUwmJZZSE6WtdpNLCx9Pg0S3O1Vj6Vl4uHd0.jpg',width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : 135 หมู่ที่ 10 อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่
        พิกัด : https://goo.gl/maps/uVKnZAsbtnjkhhaa7
        เปิดให้เข้าชม : 09.00-16.00 น.
        โทร : 0-5332-8054
        เว็บไซต์ : http://www.watumong.org
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('10.สวนสัตว์เชียงใหม่')
        st.write('&nbsp;&nbsp;&nbsp; ที่เที่ยวเชียงใหม่ ที่พลาดไม่ได้อีกแห่งก็คือ สวนสัตว์เชียงใหม่ นั่นเองค่ะ ตั้งอยู่ใกล้กับสวนรุกขชาติห้วยแก้ว ใครอยากไปเจอน้องๆ น่ารัก ก็แวะไปกันได้ ภายในสวนสัตว์มีสัตว์นานาชนิด และแบ่งออกเป็นหลายโซนด้วยกัน รวมถึงยังมีกิจกรรมมากมายอีกด้วยค่ะ')
        st.image('https://www.reviewchiangmai.com/wp-content/uploads/p16e93ft731dj716pgenas9q104u3.jpg',width=700)
        st.write(
            '&nbsp;&nbsp;&nbsp; และไฮไลท์สำคัญของสวนสัตว์เลยก็คือ แพนด้า สุดน่ารัก น้องแพนด้าตัวอ้วนนี้มาไกลจากประเทศจีนทีเดียวค่ะ และน้องยังถือว่าเป็นทูตสันถวไมตรีระหว่าง 2 ประเทศอีกด้วย ใครอยากเจอเจ้าแพนด้าน่ารักตัวเป็นๆ แบบนี้ แวะมาที่เชียงใหม่ได้เลย')
        st.image('https://i.ytimg.com/vi/I3H5XzZfMi8/maxresdefault.jpg',width=700)
        #st.write('&nbsp;&nbsp;&nbsp; และไฮไลท์สำคัญของสวนสัตว์เลยก็คือ แพนด้า สุดน่ารัก น้องแพนด้าตัวอ้วนนี้มาไกลจากประเทศจีนทีเดียวค่ะ และน้องยังถือว่าเป็นทูตสันถวไมตรีระหว่าง 2 ประเทศอีกด้วย ใครอยากเจอเจ้าแพนด้าน่ารักตัวเป็นๆ แบบนี้ แวะมาที่เชียงใหม่ได้เลย')
        #st.image('')
        st.text('\n')
        st.text('''
        ที่อยู่ : 100 ถนนศรีวิชัย ตำบลสุเทพ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่
        พิกัด : https://goo.gl/maps/YcFJZAWimMKw7FWFA
        เปิดให้เข้าชม : 08.00-17.00 น.
        โทร : 0-5322-1179
        เว็บไซต์ : https://www.facebook.com/FanpageChiangMaiZoo
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('อ้างอิงค์ https://travel.trueid.net/detail/K2qVnyVo7MO')

if selected_option == "สงขลา":
    travel6 = st.sidebar
    if travel6:
        st.markdown(
            f"""
                                                                  <style>
                                                                  .stApp {{
                                                                      background-image: url("https://cdn.pixabay.com/photo/2016/05/22/19/19/background-1409037__340.png");
                                                                      background-attachment: fixed;
                                                                      background-size: cover;
                                                                      /* opacity: 0.3; */
                                                                  }}
                                                                  </style>
                                                                  """,
            unsafe_allow_html=True)
        st.title('สถานที่ท่องเที่ยวใน สงขลา')
        st.header('จังงหวัด "สงขลา" มีผู้าเข้าชมเฉี่ยต่อปี 581,808 คน ในปี ค.ศ.2023 และมีรายได้จากการท่องเที่ยว  3,602 ล้านบาท')


        st.write('1.เกาะยอ')
        st.write('&nbsp;&nbsp;&nbsp; เกาะยอ ตั้งอยู่บน ทะเลสาบสงขลา เป็นพื้นที่ของภูเขาสลับกับเนินสูง มีชุมชนอาศัยอยู่ประมาณ 4,000 คน ส่วนใหญ่จะมีเชื้อสายจีนค่ะ และมีสินค้าที่มีชื่อเสียงอย่าง ผ้าทอเกาะยอ ลายราชวัตถ์ นั่นเองที่เป็นเอกลักษณ์ของที่นี่ค่ะ ซึ่งเป็นลายที่ได้รับพระราชทานนามจากในหลวงรัชกาลที่ 7 ค่ะ เป็นชุมชนที่ยังคงวิถีชีวิตประเพณีในแบบดั้งเดิมเอาไว้ และมีที่เที่ยวสวยๆ มากมายหลายแห่งด้วยกันค่ะ')
        st.image('https://s359.kapook.com/pagebuilder/3f5b0aca-2677-4a6d-8ca2-149324106d8b.jpg', width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : ตำบลเกาะยอ อำเภอเมืองสงขลา จังหวัดสงขลา
        พิกัด : https://goo.gl/maps/pqBr3tF5Gsn9D3U26  
        เปิดให้เข้าชม : ทุกวัน
        โทร : -
        เว็บไซต์ : -
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('2.ลิวงค์ จะนะ')
        st.write('&nbsp;&nbsp;&nbsp;    ลิวงค์ จะนะ แห่งนี้ เป็นสถานที่ท่องเที่ยวชื่อดังในจังหวัดสงขลา ที่ได้รับการขนานนามว่าเป็น สวิตเซอร์แลนด์จะนะ เพราะมี หุบเขาดินแดง ที่สวยงดงาม เงียบสงบ ร่มรื่น และบรรยากาศดีมากๆ ค่ะ เหมาะกับการนั่งชิลๆ พักผ่อน กางเต็นท์ แคมป์ปิ้ง ชมพระอาทิตย์ขึ้นและตกอย่างมากเลยค่ะ')
        st.image('https://s359.kapook.com/pagebuilder/326a810c-ecf5-4439-9dbd-682f4dd5c6cf.jpg', width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : บ้านลิวงค์ ตำบลท่าหมอไทร อำเภอจะนะ จังหวัดสงขลา
        พิกัด : https://goo.gl/maps/PTZXDeSXmcDYw9T69  
        เปิดให้เข้าชม : ทุกวัน
        โทร : -
        เว็บไซต์ : -
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('3.เขาคูหา')
        st.write('&nbsp;&nbsp;&nbsp; เขาคูหา เป็นบรรยากาศของวิวทิวทัศน์ภูเขารูปร่างแปลกตาที่รายล้อมไปด้วยต้นสน แต่กลับมีความสวยงดงามมากๆ สาเหตุที่ทำให้ที่นี่กลายเป็นแบบนี้เพราะว่าเมื่อก่อนนั้นบริเวณนี้มีการทำสัมปทานเหมืองหินและมีการระเบิดภูเขา เลยทำให้ภูเขาของที่นี่มีรูปร่างหน้าตาแปลกไปจากเดิมค่ะ เลยทำให้เกิดเป็นจุดชมวิวสวยๆ แบบนี้ขึ้นมาค่ะ และอาจจะมีลุ้นได้ชมทะเลหมอกยามเช้าอีกด้วยนะคะ')
        st.image('https://s.isanook.com/tr/0/ud/284/1422817/hyt.jpg', width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : ตำบลคูหาใต้ อำเภอรัตภูมิ จังหวัดสงขลา 
        พิกัด : https://goo.gl/maps/nMca8epK4XBsRC477  
        เปิดให้เข้าชม : สามารถเที่ยวชมได้ทุกวัน
        โทร : -
        เว็บไซต์ : -
                ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('4.วัดพระมหาเจดีย์ไตรภพไตรมงคล')
        st.write('&nbsp;&nbsp;&nbsp; วัดพระมหาเจดีย์ไตรภพไตรมงคล หรือ วัดสแตนเลส ตั้งอยู่บน เขาคอหงส์ โดยจะมีองค์พระเจดีย์ที่สร้างจากสแตนเลสทั้งหมด ถือได้ว่าเป็นเจดีย์สแตนเลสหนึ่งเดียวของโลกเลยค่ะ โดยบริเวณวัดยังสามารถมองเห็นวิวของเมืองหาดใหญ่ได้รอบเลยค่ะ และมี พระมหาธาตุเจดีย์ไตรภไตรมงคล ที่สร้างขึ้นเพื่อเป็นพระราชกุศลแด่ในหลวงรัชกาลที่ 9 เนื่องในโอกาสทรงครองราชครบ 60 ปี อีกด้วยค่ะ')
        st.image('https://tatapi.tourismthailand.org/tatfs/Image/CustomPOI/Picture/P03008374_1.jpeg', width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : 80/8 หมู่ 8 ถนนถนนปุณณกัณฑ์ ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา
        พิกัด : https://goo.gl/maps/n9hzfR8AKzdabvU9A  
        เปิดให้เข้าชม : 08.00-18.00 น.
        โทร : -
        เว็บไซต์ : 
                ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('5.วัดเขารูปช้าง')
        st.write('&nbsp;&nbsp;&nbsp; วัดเขารูปช้าง เป็นที่ตั้งของเจดีย์สวยหินอ่อนที่จำลองขึ้นมาจากมหาเจดีย์พุทธคยาในประเทศอินเดียค่ะ ซึ่งวัดนี้เกิดมาจากแรงศรัทธาของพระสิงคโปร์ อย่าง พระมงคลญาณคุณ หรือ จวงเจีย ยสโร เจ้าอาวาสรูปแรกของวัดเขารูปช้างค่ะ รวมไปถึงมีถ้ำที่ภายในประดิษฐาน พระพุทธรูปต่างๆ พระอวโลกิเตศวรโพธิสัตว์มหาสัตว์องค์ใหญ่ และมีหินงอกหินย้อยให้ได้ชมกันด้วยค่ะ')
        st.image('https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/61/b3/c7/caption.jpg?w=1200&h=1200&s=1', width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : หมู่ที่ 6 ตำบลปาดังเบซาร์ อำเภอสะเดา จังหวัดสงขลา
        พิกัด : https://goo.gl/maps/5R4NapC7U7QoYZ6W6  
        เปิดให้เข้าชม : สามารถเที่ยวชมได้ทุกวัน
        โทร : -
        เว็บไซต์ : -
                ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('6.วัดราชประดิษฐาน (วัดพะโคะ)')
        st.write('&nbsp;&nbsp;&nbsp;  วัดราชประดิษฐาน หรือ วัดพะโคะ เป็นวัดที่มีความเก่าแก่ที่สุดในจังหวัดสงขลา สร้างขึ้นบน ยอดเขาพัทธสิงค์ ที่เคยเป็นศูนย์กลางการปกครองเมืองในลุ่มทะเลสาบสงขลานั่นเองค่ะ และยังเคยใช้เป็นสถานที่ทำพิธีถือน้ำพระพิพัฒน์สัตยาของเมืองพัทลุงด้วยค่ะ ที่สำคัญเลยเป็นจุดเริ่มต้นของตำนาน หลวงพ่อทวดเหยียบน้ำทะเลจืด ที่มีชื่อเสียงอีกด้วยค่ะ')
        st.image('http://www.songkhla.go.th/files/com_travel/2013-01/20130110_alrftevq.jpg', width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : 60 หมู่ 6 ตำบลชุมพล อำเภอสทิงพระ จังหวัดสงขลา
        พิกัด : https://goo.gl/maps/uJg2WtUQhNYx5wyr8  
        เปิดให้เข้าชม : 08.00-17.00 น.
        โทร : -
        เว็บไซต์ : -
                ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('7.วัดแหลมพ้อ')
        st.write('&nbsp;&nbsp;&nbsp; วัดแหลมพ้อ แห่งนี้ ถือว่าเป็นวัดเก่าแก่และเป็นแหล่งท่องเที่ยวที่สำคัญของจังหวัดสงขลาเลยค่ะ เพราะมี พระนอนปางไสยาสน์ที่ใหญ่ที่สุดในไทย ประดิษฐานอยู่ค่ะ โดยที่พระบาทนั้นจะมีลวดลายภาพศิลปะที่สวยงดงามค่ะ และวัดแห่งนี้ยังตั้งวัดอยู่ใกล้ถนนเชิงสะพานติณสูลานนท์อีกด้วย ไม่ว่าใครที่ขับรถผ่านไปมา ก็จะสามารถมองเห็นองค์พระได้แต่ไกลเลยค่ะ')
        st.image('https://kohyor.go.th/image/ratio/?file=files/com_travel/2017-05_6965f8f81d10e70.gif&width=700&height=500', width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : ตำบลเกาะยอ อำเภอเมืองสงขลา จังหวัดสงขลา
        พิกัด : https://goo.gl/maps/Djuak9u1AVpbEX6HA 
        เปิดให้เข้าชม : 06.00-18.00 น.
        โทร : -
        เว็บไซต์ : -
                ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('8.หาดสมิหลา')
        st.write('&nbsp;&nbsp;&nbsp;  หาดสมิหลา หาดชื่อดังของสงขลา ที่คงจะไม่มีใครไม่รู้จัก เป็นหาดที่มีความสวยและขาวสะอาด พร้อมบรรยากาศของทิวสนที่ร่มรื่นตลอดแนวหาด ทำให้ที่นี่เป็นเหมือนแหล่งพักผ่อนหย่อนใจของชาวสงขลานั่นเองค่ะ และมี นางเงือก สัญลักษณ์ของเมืองสงขลาตั้งอยู่กลางหาดอีกด้วยค่ะ รวมไปถึงมีเกาะในบริเวณใกล้ๆ อย่าง เกาะหนู และ เกาะแมว เช่นเดียวกันค่ะ')
        st.image('https://youimg1.tripcdn.com/target/10041f000001gpb2y5125.jpg?proc=source%2Ftrip', width=700)
        st.text('\n')
        st.text('''
        ที่อยู่ : หาดสมิหลา ถนนราชดำเนินนอก ตำบลบ่อยาง อำเภอเมืองสงขลา จังหวัดสงขลา
        พิกัด : https://goo.gl/maps/kkZipcoBEaehSmZG8  
        เปิดให้เข้าชม : ทุกวัน
        โทร : -
        เว็บไซต์ : -
                ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('9.หาดชลาทัศน์')
        st.write('&nbsp;&nbsp;&nbsp; หาดชลาทัศน์ เป็นชายหาดที่ยาวต่อเนื่องมาจากหาดสมิหลาค่ะ โดยจะมีแหลมสมิหลาเป็นจุดแบ่งเขตค่ะ ชายหาดของที่นี่จะขาวสะอาด สามารถเล่นน้ำได้ตลอดแนวเลยค่ะ มีถนนชลาทัศน์และแนวต้นสนให้ความร่มรื่นเลียบแนวชายหาดตลอดทางค่ะ นอกจากนี้ยังเป็นจุดชมพระอาทิตย์ขึ้นที่สวยงามอีกแห่งด้วยค่ะ รวมไปถึงที่หาดจะมีเวทีประชาชนเทศบาลนครสงขลา เป็นสวนสาธารณะพักผ่อนหย่อนใจของชาวสงขลาอีกด้วยค่ะ')
        st.image('https://lh5.googleusercontent.com/p/AF1QipNrA8cSOfUmMJSQF8WaFSXfkNvecv9bSvqiIe3A=w592-h404-n-k-no-v1', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ถนนชลาทัศน์ ตำบลบ่อยาง อำเภอเมืองสงขลา จังหวัดสงขลา
พิกัด : https://goo.gl/maps/dfRkWV4H4zwZ1wKT6 
เปิดให้เข้าชม : สามารถเข้าชมได้ตลอดทั้งวัน
โทร : -
เว็บไซต์ : -
                ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('10.ย่านเมืองเก่าสงขลา')
        st.write('&nbsp;&nbsp;&nbsp;  ย่านเมืองเก่าสงขลา เป็นบริเวณที่มีประวัติความเป็นมาและมีอายุยาวนานกว่า 200 ปีเลยทีเดียวค่ะ จะเห็นได้จากความเก่าแก่ของตึก อาคาร และบ้านเรือนในบริเวณนี้ที่ยังคงอยู่ โดยมี ถนนนครนอก ถนนนครใน และ ถนนนางงาม เป็นถนนสายสำคัญค่ะ แต่ที่เป็นเอกลักษณ์ของที่นี่ ก็คงจะเป็น ภาพวาดสตรีทอาร์ท ตามตึกราบ้านช่องที่สะท้อนถึงเรื่องราววิถีชีวิตและวัฒนธรรมของคนสงขลานั่นเองค่ะ')
        st.image('https://www.songkhla.go.th/files/com_travel/2016-12_fe92ceded65348c.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลบ่อยาง อำเภอเมืองสงขลา จังหวัดสงขลา
พิกัด : https://goo.gl/maps/PtLCJ9ceXyD4kAVt8  
เปิดให้เข้าชม : ทุกวัน
โทร : -
เว็บไซต์ : -
                ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('อ้างอิงค์ https://travel.trueid.net/detail/wLKn71xQBzZW')

if selected_option == "พังงา":
    travel7 = st.sidebar
    if travel7:
        st.markdown(
            f"""
                                                                          <style>
                                                                          .stApp {{
                                                                              background-image: url("https://img.rawpixel.com/private/static/images/website/2022-05/rm218batch6-katie-33.jpg?w=800&dpr=1&fit=default&crop=default&q=65&vib=3&con=3&usm=15&bg=F4F4F3&ixlib=js-2.2.1&s=14cd904d9faf1bbc9af209ba45cc480c");
                                                                              background-attachment: fixed;
                                                                              background-size: cover;
                                                                              /* opacity: 0.3; */
                                                                          }}
                                                                          </style>
                                                                          """,
            unsafe_allow_html=True)
        st.title('สถานที่ท่องเที่ยวใน พังงา')
        st.header('จังงหวัด "พังงา" มีผู้าเข้าชมเฉี่ยต่อปี พังงา 317,353 คน ในปี ค.ศ.2023 และมีรายได้จากการท่องเที่ยว  2,582 ล้านบาท')

        st.write('1.จุดชมวิวเสม็ดนางชี')
        st.write('&nbsp;&nbsp;&nbsp; จุดชมวิวเสม็ดนางชี ที่เที่ยวชื่องดังของ พังงา ที่คงจะไม่มีใครไม่รู้จัก เพราะถือได้ว่าเป็นอีกหนึ่ง จุดชมวิวชมพระอาทิตย์ขึ้น ที่สวยที่สุดแห่งหนึ่งของประเทศไทยเลยค่ะ สามารถมองเห็นทั้งวิวทิวทัศน์ของเกาะแก่งต่างๆ ภูเขาหินปูน ของ อ่าวพังงา โดยเฉพาะในช่วงเช้าที่แสงของพระอาทิตย์ส่องเป็นประกายแสงออกมา บอกเลยว่าจะหลงรักไปอีกนานทีเดียวค่า')
        st.image('https://s359.kapook.com/pagebuilder/4718a346-368e-4de7-b590-e994027505e9.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลคลองเคียน อำเภอตะกั่วทุ่ง จังหวัดพังงา
พิกัด : https://goo.gl/maps/1wJQXy1wZ4wSEKVk8   
เปิดให้เข้าชม : สามารถเข้าชมได้ตามเวลาเปิดปิดของพื้นที่
โทร : -
เว็บไซต์ : -
                ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('2.เกาะสิมิลัน')
        st.write('&nbsp;&nbsp;&nbsp;  หมู่เกาะสิมิลัน ที่ตั้งอยู่ภายใน อุทยานแห่งชาติหมู่เกาะสิมิลัน จังหวัดพังงา แห่งนี้ ได้รับการขนานนามให้เป็นสวรรค์ของนักดำน้ำอีกแห่งนึงของประเทศไทยเลยทีเดียวค่ะ โดยภาพที่เห็นตรงหน้าจะเป็นความสวยงามของหาดทรายสีขาวเนื้อละเอียด น้ำทะเลสีฟ้าใสราวกับคริสตัล และแนวปะการังที่อุดมไปด้วยปลาทะเลหลากสายพันธุ์มากมาย สวยขนาดนี้จะพลาดไม่ได้แล้ว')
        st.image('https://s.isanook.com/tr/0/rp/r/w850/ya0xa0m1w0/aHR0cHM6Ly9zLmlzYW5vb2suY29tL3RyLzAvdWQvMjgzLzE0MTc5ODkvcy5qcGc=.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : อุทยานแห่งชาติหมู่เกาะสิมิลัน เลขที่ 93 หมู่ที่ 5 บ้านทับละมุ ถนนเพชรเกษม ตำบลลำแก่น อำเภอท้ายเหมือง จังหวัดพังงา
พิกัด : https://goo.gl/maps/32L4izpNCpnf99Ze6 
เปิดให้เข้าชม : 15 ตุลาคม-15 พฤษภาคม ของทุกปี
โทร : 0-7645-3272
เว็บไซต์ : https://www.facebook.com/MuKoSimilanNationalPark
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.write('3.เกาะยาวน้อย')
        st.write('&nbsp;&nbsp;&nbsp; เกาะยาวน้อย เป็นเกาะที่ค่อนข้างจะเงียบสงบ เหมาะสำหรับนักท่องเที่ยวที่ชอบความสงบ และอยากดื่มด่ำกับบรรยากาศของธรรมชาติอย่างแท้จริงค่ะ ที่ เกาะยาวน้อย นั้น จะมีการจัดตั้งกลุ่มโฮมสเตย์ขึ้นมา ซึ่งได้รับการยอมรับและมีชื่อเสียง รวมถึงการจัดการที่ดี จนได้รับรางวัลมาแล้วมากมายเลย วิถีชีวิตบนเกาะที่เราจะเห็นได้แบบชัดๆ เลย คือ การทำนา การทำเครื่องมือประมง การทำผ้าบาติก ผ้ามัดย้อมจากสีธรรมชาติ และการทำผลิตภัณฑ์จากกะลามะพร้าว นั่นเองค่ะ')
        st.image('https://youimg1.tripcdn.com/target/100n1f000001gpdpj8A8A_C_640_320_R5_Q70.jpg_.webp?proc=source%2Ftrip', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลเกาะยาวน้อย อำเภอเกาะยาว จังหวัดพังงา
พิกัด : https://goo.gl/maps/viUDAySxkZhFbGA5A   
เปิดให้เข้าชม : สามารถสอบถามได้จากที่พักหรือบริษัททัวร์
โทร : -
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.write('4.เกาะยาวใหญ่ ')
        st.write('&nbsp;&nbsp;&nbsp; เกาะยาวใหญ่ เป็นสถานที่ท่องเที่ยวแบบสัมผัสวิถีชาวบ้านในชุมชนของมุสลิม เน้นการพักผ่อนแบบนอนโฮมสเตย์เก๋ๆ ล่องเรือดูป่าโกงกางยักษ์ ด้วยความที่เกาะแห่งนี้ตั้งอยู่กลางทะเลมหาสมุทรอันดามัน ทำให้ยังคงเสน่ห์ไว้อย่างมากเลยทีเดียวค่ะ แต่เห็นแบบนี้กิจกรรมแน่นอย่าบอกใครเลย เป็นกิจกรรมสนุกๆ ในสไตล์พื้นบ้าน ธรรมชาติเน้นๆ ซึ่งเกิดขึ้นมาจากความร่วมมือของชาวบ้านในพื้นที่นั่นเอง ที่สำคัญอย่าลืมลิ้มลองอาหารทะเลสดๆ ในสไตล์พื้นบ้านกันนะคะ')
        st.image('https://mpics.mgronline.com/pics/Images/565000006808612.JPEG', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลพรุใน อำเภอเกาะยาว จังหวัดพังงา
พิกัด : https://goo.gl/maps/ABMsNZSuc2iuvqsY9 
เปิดให้เข้าชม : สามารถเที่ยวได้ทั้งวัน
โทร : -
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.write('5.เกาะไข่ เกาะไข่แมว')
        st.write('&nbsp;&nbsp;&nbsp;  เกาะไข่ ที่เที่ยวพังงา ชื่อดัง ที่รวมทั้ง เกาะไข่นอก เกาะไข่ใน เกาะไข่นุ้ย ทะเลสวยๆ ต้องห้ามพลาดเลย เป็นจุดที่สามารถดำน้ำดูปะการังอันอุดมสมบูรณ์ได้ และที่สำคัญยังเป็นที่ตั้งของ เกาะไข่แมว หรือ เกาะแมว เกาะที่ทาสแมวหลายๆ คนอยากจะไปกันสักครั้ง ใครเป็นสายเที่ยวทะเล ชอบดำน้ำ เดินชายหาดสวยๆ ต้องมาที่แล้วค่า')
        st.image('https://www.yophuket.com/image/item/e4d6865de6fc4087e2076e8dab6d02c6.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลพรุใน อำเภอเกาะยาว จังหวัดพังงา
พิกัด : https://goo.gl/maps/TmYDybdgY5qwAMRs7  
เปิดให้เข้าชม : 08.00-16.30 น.
โทร : -
เว็บไซต์ : -

                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.write('6.หมู่เกาะสุรินทร์')
        st.write('&nbsp;&nbsp;&nbsp; อุทยานแห่งชาติหมู่เกาะสุรินทร์ เป็นหมู่เกาะที่ตั้งอยู่ในทะเลอันดามัน และเป็นอีกแห่งอุทยานแห่งชาติที่งดงาม รวมถึงยังเป็นห้องเรียนธรรมชาติที่สมบูรณ์ รวมระบบนิเวศน์เข้าไว้ด้วยกัน ทั้งจากป่าดิบชื้น ป่าชายหาด ป่าชายเลน แนวปะการัง ซึ่งเป็นระบบนิเวศน์ที่หลากหลายที่สุดในท้องทะเลเลยทีเดียวค่ะ นอกจากนี้ ยังเป็น 1 ใน 10 อันดับ แหล่งดำน้ำที่สวยที่สุดในโลกอีกด้วย โดยเฉพาะ กองหินริชิลิว ที่จะมีทั้ง ปะการังอ่อน ปะการังพัด กัลปังหา และดอกไม้ทะเล หลากหลายชนิดด้วยกัน รวมถึงยังมีสัตว์น้ำหายากบางชนิดอีกด้วย และถ้าโชคดีอาจจะได้พบฉลามวาฬตรงนี้อีกด้วยนะคะ')
        st.image('https://s359.kapook.com/pagebuilder/50c7e73c-dc00-4d32-8a50-1902c32f46c0.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : อุทยานแห่งชาติหมู่เกาะสุรินทร์ อำเภอคุระบุรี จังหวัดพังงา
พิกัด : https://goo.gl/maps/uB76FT9opky5dTU47  
เปิดให้เข้าชม : สามารถเข้าชมได้ตามเวลาเปิดปิดของสถานที่
โทร : -
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.write('7.คลองสังเน่ห์')
        st.write('&nbsp;&nbsp;&nbsp;  คลองสังเน่ห์ หรือที่เรียกกันว่า Little Amazon เป็นผืนป่าเล็กๆ ที่เต็มไปด้วยความหลากหลาย มีพืชพรรณขึ้นอยู่ตามริมคลองมากมาย เป็นเสน่ห์ที่ทำให้น่ามาเยือนอย่างมาก เลยถูกตั้งฉายาว่าเป็น Little Amazon นั่นเองค่ะ ไฮไลท์ของการมาเที่ยวที่นี่ คือการได้ล่องเรือชมวิวของธรรมชาติรอบๆ และลอดผ่านอุโมงค์ต้นไทรอายุนับร้อยปีไปค่ะ รวมถึงยังได้ชมสัตว์ป่ามากมาย ทั้ง นกเงือก นกกระสา งู เป็นต้น')
        st.image('https://www.nairobroo.com/wp-content/uploads/2019/08/%E0%B8%84%E0%B8%A5%E0%B8%AD%E0%B8%87%E0%B8%AA%E0%B8%B1%E0%B8%87%E0%B9%80%E0%B8%99%E0%B9%88%E0%B8%AB%E0%B9%8C-2-768x509.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลบางนายสี อำเภอตะกั่วป่า จังหวัดพังงา
พิกัด : https://goo.gl/maps/zuychWtHqrswKM9E7  
เปิดให้เข้าชม : 09.00-17.00 น.
โทร : 0-86953-1789 , 0-7642-4176
เว็บไซต์ : -

                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.write('8.เกาะปันหยี')
        st.write('&nbsp;&nbsp;&nbsp;  เกาะปันหยี เกาะหมู่บ้านชาวประมงที่ตั้งอยู่ในจังหวัดพังงา เป็นชุมชนของชาวประมงอินโดนีเซียที่อพยพมาเมื่อ 200 ปีก่อน โดยการก่อสร้างของหมู่บ้านแทบทั้งหมดนั้น จะอยู่ด้านหน้าของหน้าผาหินปูน ซึ่งเหนือน้ำทะเล ทำให้ในช่วงเวลาน้ำขึ้น เลยดูเหมือนว่าหมู่บ้านปันหยีลอยอยู่กลางท้องทะเลนั่นเองค่ะ ซึ่งเหตุผลนี้เองก็ทำให้ที่นี่กลายมาเป็นสถานที่ท่องเที่ยวที่มีเอกลักษณ์อีกแห่งของพังงาค่ะ')
        st.image('https://img.kapook.com/u/2021/sutasinee/05/Koh-Panyee13.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลเกาะปันหยี อำเภอเมือง จังหวัดพังงา
พิกัด : https://goo.gl/maps/wHcmepEVyJXaap1X9
เปิดให้เข้าชม : สามารถเข้าชมได้ตามเวลาเปิดปิดของสถานที่
โทร : -
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.write('9.หาดนางทอง')
        st.write('&nbsp;&nbsp;&nbsp; หาดนางทอง หรือ หาดทรายดำ เป็นความ Unseen ของ พังงา ตั้งอยู่ใน เขาหลัก เป็นขี้แร่ที่เกิดขึ้นมาจากการร่อนแร่เมื่อสมัยก่อนนั่นเองค่ะ ความพิเศษของหาดทรายนี้นอกจากจะมีสีไม่เหมือนทรายอื่นๆ แล้วเรายังไม่สามารถกะเกณฑ์ได้ว่า หาดทรายสีดำ จะโผล่ขึ้นมามากน้อยขนาดไหนอีกด้วยนะคะ เรียกว่าต้องลุ้นเท่านั้นเลย เพราะตามปกติแล้วทรายสีดำจะถูกคลื่นซัดสลับกันไปมา เวลาที่น้ำขึ้นมาก็จะพาทรายปกติขึ้นมาด้วยนั่นเอง ทำให้ต้องอดทนรอเวลาให้แร่สีดำค่อยๆ โผล่ขึ้นมาค่ะ')
        st.image('https://www.thaiticketmajor.com/variety/img_news/title/original1/2439/11439/title_ttmnews_11439-20190521143218.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : เขาหลัก ตำบลคึกคัก อำเภอตะกั่วป่า จังหวัดพังงา
พิกัด : https://goo.gl/maps/ERrR1NJ7XjGJKkeW8 
เปิดให้เข้าชม : เปิดให้เข้าชมตลอดเวลา
โทร : -
เว็บไซต์ : -

                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.write('10.หมู่บ้านมอแกน')
        st.write('&nbsp;&nbsp;&nbsp; หมู่บ้านมอแกน แห่งนี้เป็นชุมชนของชาวมอแกน ชุมชนพื้นเมืองที่อาศัยอยู่ตามเกาะแก่งในทะเลอันดามัน และสืบเชื้อสายมาจากโปโตมาเลซึ่งร่อนเร่อยู่ในทะเลอันดามันมามากว่า 100 ปีนั่นเองค่ะ วิถีชีวิตและวัฒนธรรมเป็นเอกลักษณ์ของตนเองนี้เอง ทำให้ที่นี่มีเสน่ห์อย่างมาก รวมถึงมีท้องทะเลสีฟ้าใสสวยสุดๆ จนที่นี่ได้รับการฉายาว่าเป็น สวรรค์กลางทะเล เลยทีเดียวค่ะ')
        st.image('https://resource.nationtv.tv/resource/photo_news/2020/11/14/640_a6j5ki9gaf6gk78dii9cb.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : หมู่เกาะสุรินทร์ ตำบลเกาะพระทอง อำเภอคุระบุรี จังหวัดพังงา
พิกัด : https://goo.gl/maps/2fwgjQR2R4dfhzE16  
เปิดให้เข้าชม : สามารถเข้าชมได้ตามเวลาเปิดปิดของสถานที่
โทร : -
เว็บไซต์ : - 
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

if selected_option == "เชียงราย":
    travel8 = st.sidebar
    if travel8:
        st.markdown(
            f"""
                                                                                  <style>
                                                                                  .stApp {{
                                                                                      background-image: url("https://t3.ftcdn.net/jpg/04/20/65/20/360_F_420652072_R1a3q3zhdZeAULiCloLI5FE8xlqdQ18i.jpg");
                                                                                      background-attachment: fixed;
                                                                                      background-size: cover;
                                                                                      /* opacity: 0.3; */
                                                                                  }}
                                                                                  </style>
                                                                                  """,
            unsafe_allow_html=True)
        st.title('สถานที่ท่องเที่ยวใน เชียงราย')
        st.header('จังงหวัด "เชียงราย" มีผู้าเข้าชมเฉี่ยต่อปี เชียงราย 148,683 คน ในปี ค.ศ.2023 และมีรายได้จากการท่องเที่ยว  เชียงราย 1,585 ล้านบาท')

        st.write('1.วัดร่องขุ่น')
        st.write('&nbsp;&nbsp;&nbsp;  วัดร่องขุ่น คือจุดหมายแรกที่ไม่ควรพลาด เพราะเป็นวัดที่มีความงดงามอลังการที่สุดแห่งหนึ่งในประเทศไทย ออกแบบก่อสร้างโดยอาจารย์เฉลิมชัย โฆษิตพิพัฒน์ ซึ่งได้สร้างงานพุทธศิลป์นี้เพื่อถวายเป็นงานศิลปะแด่พระบาทสมเด็จพระเจ้าอยู่หัวฯ')
        st.write('&nbsp;&nbsp;&nbsp;  ความงดงามของวัดโด่งดังไกลไปถึงต่างประเทศ ด้วยอุโบสถสีขาวประดับด้วยกระจกสีเงินแวววาว และลวดลายปูนปั้นอันวิจิตรเป็นเอกลักษณ์ รวมถึงประดับด้วยภาพจิตรกรรมฝาผนังที่งดงามประณีตชนิดที่เห็นแล้วต้องตะลึง')
        st.image('https://image-tc.galaxy.tf/wijpeg-7pqufmqti0twcdzzq3btsb5lq/wat-rong-khun.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลป่าอ้อดอนชัย อำเภอเมืองเชียงราย จังหวัดเชียงราย
พิกัด : https://goo.gl/maps/Rb2CXiJ5RtDuQqHe8
เปิดให้เข้าชม : 08.00-17.00 น.
โทร : 0-5367-3579
เว็บไซต์ : https://www.facebook.com/วัดร่องขุ่น
        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('2.สวนแม่ฟ้าหลวง ')
        st.write('&nbsp;&nbsp;&nbsp;  สวนแม่ฟ้าหลวง ตั้งอยู่ด้านหน้า พระตำหนักดอยตุง ที่นี่เป็นอีกจุดถ่ายรูปสวยๆ ในเชียงราย เต็มไปด้วย สวนดอกไม้เมืองหนาว ที่พร้อมใจกันเบ่งบานอวดความสวยงาม เช่น กุหลาบ พิทูเนีย และบีโกเนีย อีกทั้งยังมีไม้มงคล ไม้ยืนต้น และซุ้มไม้เลื้อย ซึ่งปลูกไว้อีกหลายชนิดเลยค่ะ ')
        st.write('&nbsp;&nbsp;&nbsp; สวนแห่งนี้มีพื้นที่ทั้งหมด 25 ไร่ค่ะ เป็นสวนดอกไม้หมุนเวียนสลับไปทุกฤดู 12 ไร่ และเป็นสวนปาล์ม ภูเขาหินต่างๆ 13 ไร่ ภายในสวนก็จะมีสวนดอกไม้ต่างๆ โรงเรือนไม้ในร่ม จุดเด่นคือกล้วยไม้จำพวกรองเท้านารีชนิดต่างๆ และ งานประติมากรรมเด็กยืนต่อตัว ซึ่งได้รับพระราชทานชื่อว่า "ความต่อเนื่อง" ')
        st.image('https://www.touronthai.com/gallery/photo/2001001/neadoitung11.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : อำเภอแม่ฟ้าหลวง จังหวัดเชียงราย
พิกัด : https://goo.gl/maps/ptp9XuMQh3j82TTJ7
เปิดให้เข้าชม : 07.00-18.00 น.
โทร : 0-2252-7114
เว็บไซต์ : https://www.facebook.com/DoiTungClub
              ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('3.พระธาตุดอยตุง')
        st.write('&nbsp;&nbsp;&nbsp; เที่ยวจังหวัดเชียงราย ต้องห้ามพลาดการแวะไปสักการะ พระธาตุดอยตุง ซึ่งมีความเก่าแก่สวยงาม ตั้งอยู่บนยอดเขาใน วัดพระธาตุดอยตุง ที่สามารถมองเห็นวิวเมืองเชียงรายได้อย่างเต็มตาค่ะ พระธาตุดอยตุง มีลักษณะเป็นเจดีย์สีทองอร่าม 2 องค์คู่กันงดงาม')
        st.write('&nbsp;&nbsp;&nbsp;  ตามตำนานกล่าวว่าเป็นเจดีย์แห่งแรกในอาณาจักรล้านนา ที่พระเจ้าอชุตราชทรงอัญเชิญ พระบรมสารีริกธาตุจากประเทศอินเดียมาบรรจุไว้ในเจดีย์ ต่อมา ครูบาเจ้าศรีวิชัย ได้บูรณะใหม่และสร้างพระธาตุองค์ใหม่ขึ้นมาคู่กัน อีกทั้งพระธาตุดอยตุงยังเป็น พระธาตุประจำปีกุน ตามความเชื่อล้านนาอีกด้วย')
        st.image('https://www.papaiwat.com/th/file/get/file/20180707e4da3b7fbbce2345d7772b0674a318d5191810.jpg', width=700)
        st.text('\n')
        st.text('''
ที่ตั้ง : 399 ตำบลห้วยไคร้ อำเภอแม่สาย จังหวัดเชียงราย
พิกัด : https://goo.gl/maps/6So4CHYLFsqAXa1k8
เปิดเข้าชม : 08.00-18.00 น.
โทร : 08-0716-5071
เว็บไซต์ : https://www.facebook.com/watphathatdoitung
              ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('4.พระตำหนักดอยตุง')
        st.write('&nbsp;&nbsp;&nbsp; พระตำหนักดอยตุง หรือ พระตำหนักสมเด็จย่า เป็นตำหนักปลูกสร้างบนเนินเขารายล้อมด้วยต้นไม้นานาพันธุ์ เกิดขึ้นโดยพระราชดำริของ สมเด็จพระศรีนครินทราบรมราชชนนี ที่ได้พระราชทานพระราชทรัพย์ส่วนพระองค์สร้างขึ้น เพื่อเป็นที่จะได้ทรงแปรพระราชฐานมาทรงงานที่นี่')
        st.write('&nbsp;&nbsp;&nbsp; พระตำหนักมีลักษณะโดดเด่นทางสถาปัตยกรรมเป็นศิลปะแบบล้านนา ที่เป็นบ้านปีกไม้ มีกาแล ผสมกับลักษณะบ้านพื้นเมืองของชาวสวิตเซอร์แลนด์ที่เรียกว่า ชาเล่ต์ มีไม้แกะสลักเป็นเชิงลายเมฆไหลอ่อนช้อน เน้นความเรียบง่ายแต่ใช้สอยได้อย่างครบครัน ปัจจุบัน เปิดเป็นพิพิธภัณฑ์ให้นักท่องเที่ยวเข้าชมด้านในได้ค่ะ โดยจะจัดแสดงข้าวของเครื่องใข้ต่างๆ ของ สมเด็จย่า ')
        st.image('http://travel.mthai.com/app/uploads/2014/11/1254.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : อำเภอแม่ฟ้าหลวง จังหวัดเชียงราย
พิกัด : https://goo.gl/maps/MWsY7GFfiuupzd4E6
เปิดให้เข้าชม : 07.00-18.00 น.
โทร : 0-5376-7015-7
เว็บไซต์ : https://www.facebook.com/DoiTungClub
              ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('5.สิงห์ปาร์ค เชียงราย')
        st.write('&nbsp;&nbsp;&nbsp; สิงห์ปาร์ค เชียงราย คือหนึ่งในแลนด์มาร์ที่ต้องแวะเช็คอินถ่ายรูป โดยเฉพาะกับสิงห์ตัวยักษ์สีเหลืองทองด้านหน้าทางเข้า ภายในไร่มีกิจกรรมน่าสนใจมากมาย ทั้งการนั่งรถรางชมไร่ ซึ่งมีพื้นที่กว่า 8,000 ไร่ ปลูกพืชผัก ผลไม้ไว้หลายชนิดเลยทีเดียว')
        st.write('&nbsp;&nbsp;&nbsp; รวมถึงด้านในยังมีสระน้ำขนาดใหญ่หลายแห่ง ชมไร่ชาอู่หลงที่ปลูกเป็นแถวสวยงาม ชมชีวิตสัตว์น่ารัก อย่างยีราฟ ม้าลาย วัววาตูซี่ รวมถึงสนุกสนานไปกับการเล่นซิปไลน์สุดหวาดเสียว และปั่นจักรยานเที่ยวชมไร่ ชมความงดงามของสวนดอกไม้ที่บานสวยท้าลมหนาว บอกเลยว่า มาเที่ยวชิลๆ ได้ทั้งวันค่ะ')
        st.image('https://image-tc.galaxy.tf/wijpeg-5aacuyuvlhcy4b3sso31osv8d/singha-park.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : 99 หมู่ 1 บ้านแม่กรณ์ ตำบลแม่กรณ์ อำเภอเมืองเชียงราย จังหวัดเชียงราย
พิกัด : https://goo.gl/maps/7ANJ6r7ErXF5gbGNA
เปิดให้เข้าชม : 08.00-18.00 น.
โทร : 0-5316-0636-7
เว็บไซต์ : https://www.facebook.com/SinghaparkChiangrai
              ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('6.ไร่ชาฉุยฟง')
        st.write('&nbsp;&nbsp;&nbsp; ชมไร่ชาสีเขียวที่ปลูกลดหลั่นเป็นขั้นบันได รายล้อมด้วยภูเขาสูงของจังหวัดเชียงราย ที่ ไร่ชาฉุยฟง แหล่งปลูกชาชั้นดีของ บริษัท ฉุยฟงที จำกัด ซึ่งเป็นผู้ผลิตใบชารายใหญ่ที่สุดในจังหวัดเชียงรายมากว่า 40 ปีค่ะ ')
        st.write('&nbsp;&nbsp;&nbsp; นอกจากการชมความงดงามของไร่ชากว้างแล้ว แน่นอนว่าที่นี่ชาให้ได้ชิม และมีร้านอาหารอร่อยๆ บริการ ส่วนใครที่ชอบถ่ายภาพ ห้ามพลาดการสวนชุดชาวเขาถือตะกร้าโพสต์ท่าเก็บใบชากันด้วย')
        st.image('http://ibreak2travel.com/wp-content/uploads/2016/03/knp_7367-hdr-1140x700.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : 97 หมู่ 8 อำเภอแม่จัน จังหวัดเชียงราย
พิกัด : https://goo.gl/maps/R1bCBsSS621TGLHGA
เปิดให้เข้าชม : 08.30-17.30 น.
โทร : 06-3779-9555
เว็บไซต์ : https://www.facebook.com/ChouiFongTea
              ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('7.พิพิธภัณฑ์ บ้านดำ')
        st.write('&nbsp;&nbsp;&nbsp; สำหรับกลุ่มผู้ชื่นชอบชมงานศิลปะแล้ว เมื่อได้มาถึงเชียงรายต้องไม่พลาดมาเยือน บ้านดำ หรือ พิพิธภัณฑ์บ้านดำ ของ อาจารย์ถวัลย์ ดัชนี ศิลปินแห่งชาติผู้สร้างสรรค์ผลงานศิลปะอันทรงคุณค่า')
        st.write('&nbsp;&nbsp;&nbsp; ที่พิพิธภัณฑ์บ้านดำ ประกอบด้วยบ้านทั้งหมด 36 หลัง สร้างด้วยศิลปะซึ่งได้รับแรงบันดาลใจมาจากล้านช้าง ล้านนา และสุวรรณภูมิ มีเอกลักษณ์คือทาด้วยสีดำทั้งหมด ภายในเป็นที่จัดเก็บผลงานศิลปะและของสะสมของอาจารย์ ทั้งงานจิตรกรรม ประติมากรรม และของสะสมจากทั่วโลก')
        st.image('https://www.chillpainai.com/src/wewakeup/img_travel/162/6.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : 414 หมู่ 13 บ้านดำ ตำบลนางแล อำเภอเมืองเชียงราย จังหวัดเชียงราย
พิกัด : https://goo.gl/maps/nc4LQw4QGpneiUqq9
เปิดให้เข้าชม : 09.00-17.00 น.
โทร : -
เว็บไซต์ : 
              ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('8.วัดพระแก้ว เชียงราย')
        st.write('&nbsp;&nbsp;&nbsp; วัดพระแก้ว คือหนึ่งในวัดสำคัญของจังหวัดเชียงราย เพราะเป็นสถานที่ค้นพบพระแก้วมรกต โดยในสมัยพระเจ้าสามฝั่งแกน ได้เกิดฟ้าผ่าเจดีย์ร้างองค์หนึ่งจนพังทลายลงมา และพบว่ามีพระพุทธรูปลงรักปิดทองตกลงมา เมื่อรักกระเทาะออกจึงเห็นเป็นแก้วสีเขียวทั้งองค์')
        st.write('&nbsp;&nbsp;&nbsp; จากนั้นจึงได้มีการอัญเชิญไปประดิษฐาน ณ ที่ต่างๆ ตั้งแต่ลำปาง เชียงใหม่ หลวงพระบาง เวียงจันทน์ กรุงธนบุรี และกรุงเทพมหานคร ปัจจุบัน วัดพระแก้ว เชียงราย มีพระแก้วหยกประดิษฐานอยู่ ซึ่งเป็นพระพุทธรูปที่สร้างขึ้นเนื่องในวโรกาสที่สมเด็จพระศรีนครินทราบรมราชชนนีมีพระชนมายุครบ 90 พรรษา')
        st.image('https://www.paiduaykan.com/travel/wp-content/uploads/2021/01/DSC_8885.jpg', width=700)
        st.text('\n')
        st.text('''

              ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('9.ตลาดแม่สาย')
        st.write('&nbsp;&nbsp;&nbsp; นอกจากถ่ายรูปกับป้ายเหนือสุดแดนสยามที่อำเภอแม่สาย แล้ว ที่ต้องแวะเลยก็คือ ตลาดแม่สาย แหล่งช้อปปิ้งสินค้าพื้นเมืองและสินค้าราคาถูก เช่น สบู่สมุนไพร เครื่องทองเหลือง ขนมขบเคี้ยว เสื้อผ้า กระเป๋า รองเท้า และของใช้ทั่วไป สายช้อปเพลินมากแน่นอน')
        st.write('&nbsp;&nbsp;&nbsp; ที่นี่ยังมีผลไม้ราคาถูก รวมถึงเกาลัดคั่วที่ต้องซื้อติดมือทุกครั้งไป ส่วนใครที่อยากไปซื้อของที่ตลาดฝั่งเมียนมาร์ สามารถข้ามได้โดยใช้บัตรประชาชน มีค่าบริการและค่าผ่านเขตแดนค่ะ')
        st.image('https://www.maehongsongreentravel.com/images/content/original-1615109196125.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : 209 ถนนพหลโยธิน ตำบลเวียงพางคำ อำเภอแม่สาย จังหวัดเชียงราย
พิกัด : https://goo.gl/maps/38ni3PYHEuVbh3bdA
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
โทร : -
เว็บไซต์ : -
              ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('10.สามเหลี่ยมทองคำ')
        st.write('&nbsp;&nbsp;&nbsp;  สามเหลี่ยมทองคำ คือพื้นที่รอยต่อระหว่าง 3 ประเทศ คือไทย ลาว และเมียนมา มีลักษณะเป็นพื้นที่สามเหลี่ยมมาบรรจบกันโดยมีแม่น้ำโขงตัดผ่านชายแดนไทยและลาว เป็นจุดสำคัญทางเศรษฐกิจและเป็นแหล่งท่องเที่ยวที่สำคัญ')
        st.write('&nbsp;&nbsp;&nbsp; นอกจากการแวะไปถ่ายรูปทิวทัศน์สามเหลี่ยมทองคำแล้ว ยังสามารถไหว้พระพุทธรูปองค์โต หรือนั่งเรือล่องไปตามน้ำโขง ชมทิวทัศน์ของสองฝั่ง สัมผัสความงามของธรรมชาติได้อีกด้วย')
        st.image('https://tatapi.tourismthailand.org/tatfs/Image/CustomPOI/Picture/P03007613_1.jpeg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลเวียง อำเภอเชียงแสน จังหวัดเชียงราย
พิกัด : https://goo.gl/maps/d1Gf2o4RgVrCP9HA9
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
โทร : -
เว็บไซต์ : -
              ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('อ้างอิงค์ https://travel.trueid.net/detail/R0LpNq7vYQR')

if selected_option == "กระบี่":
    travel11 = st.sidebar
    if travel11 :
        st.markdown(
            f"""
                                                                                          <style>
                                                                                          .stApp {{
                                                                                              background-image: url("https://t3.ftcdn.net/jpg/04/20/65/20/360_F_420652072_R1a3q3zhdZeAULiCloLI5FE8xlqdQ18i.jpg");
                                                                                              background-attachment: fixed;
                                                                                              background-size: cover;
                                                                                              /* opacity: 0.3; */
                                                                                          }}
                                                                                          </style>
                                                                                          """,
            unsafe_allow_html=True)
        st.title('สถานที่ท่องเที่ยวใน กระบี่')
        st.header('จังงหวัด "กระบี่" มีผู้าเข้าชมเฉี่ยต่อปี กระบี่ 217,526 คน ในปี ค.ศ.2023 และมีรายได้จากการท่องเที่ยว  1,408 ล้านบาท')

        st.write('1.อ่าวนาง')
        st.write('&nbsp;&nbsp;&nbsp;  อ่าวนาง เป็นชายหาดสวยชื่อดังของจังหวัดกระบี่ค่ะ นักท่องเที่ยวส่วนใหญ่นิยมมาพักที่นี่ เพราะเป็นหาดที่มีที่พักเยอะมากให้เลือกตั้งแต่ราคาหลักร้อยไปยันหลักหมื่นเลยทีเดียว มีร้านค้าต่างๆ มากมาย และยังมีวิวทะเลที่สวยงาม อีกทั้งยังเป็นจุดต่อเรือสำหรับไปเที่ยว One day Trip ตามเกาะต่างๆ ทั้ง เกาะไก่ เกาะปอดะ เกาะทับ ทะเลแหวก เกาะห้อง เกาะพีพี และอื่นๆ อีกมากมาย สุดหาดทางด้านซ้ายเป็นภูเขาหินปูนกั้นหาดอ่าวนางกับ หาดไร่เลย์ ค่ะ ')
        st.image('https://www.krabipao.go.th/tmp/f21a04f2de3d7086237f1d57ca88793d.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลอ่าวนาง อำเภอเมืองกระบี่ จังหวัดกระบี่
พิกัด : https://goo.gl/maps/smKMekTXqZ2QZ7rT7
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
โทร : -
เว็บไซต์ : -
        ''')

        st.write('2.หมู่เกาะปอดะ')
        st.write('&nbsp;&nbsp;&nbsp; หมู่เกาะปอดะ ตั้งอยู่ทางใต้ของอ่าวนาง เป็นเกาะที่มีหาดทรายขาว น้ำทะเลใส และชายฝั่งของเกาะอุดมสมบูรณ์ไปด้วยแนวปะการัง รวมทั้งฝูงปลาน้อยใหญ่อีกด้วย จึงเป็นเกาะยอดนิยมในการมาเที่ยว ดำน้ำ ชมปะการัง และหมู่ปลาค่ะ')
        st.write('&nbsp;&nbsp;&nbsp; ใกล้ๆ กับ เกาะปอดะ จะมี เกาะทับ เกาะหม้อ เกาะไก่ ซึ่งเป็น 4 เกาะไฮไลท์ในการมาเที่ยวล่องเรือทะเลกระบี่แบบ One Day Trip ค่ะ โดยจะมีเกาะปอดะเป็นเกาะใหญ่ที่สุดนั่นเอง')
        st.image('https://www.reviewpromote.com/images/img_post/post_20170313144909.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : อำเภอเมืองกระบี่ จังหวัดกระบี่
พิกัด : https://goo.gl/maps/4fQdt7wcseBrP74w9
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตามรอบเรือนำเที่ยว
โทร : -
เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('3.ทะเลแหวก')
        st.write('&nbsp;&nbsp;&nbsp; พูดถึงกระบี่ ใครๆ ก็ต้องนึกถึง ที่เที่ยวสุด Unseen Thailand อย่าง ทะเลแหวก กระบี่ ค่ะ ที่นี่เป็นกลุ่มของเกาะ 3 เกาะ ที่มีหาดทรายเชื่อมติดกัน คือ เกาะทับ เกาะหม้อ และ เกาะไก่ โดยเราสามารถเดินไปตามสันทรายได้ตอนน้ำลงนั่นเอง เราจะได้เดินอยู่กลางทะเลที่รายล้อมไปด้วยน้ำทะเลสีน้ำเงินเข้ม ถ่ายรูปออกมา สวยอลังการแน่นอนค่ะ ')
        st.image('https://www.krabipao.go.th/tmp/82cc554305573f3526be8b681cdd20eb.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : อำเภอเมืองกระบี่ จังหวัดกระบี่
พิกัด : https://goo.gl/maps/ytjFAPyxDBPscfWv9
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตามรอบเรือนำเที่ยว
โทร : -
เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('4.เกาะพีพี')
        st.write('&nbsp;&nbsp;&nbsp; เกาะพีพี ถือเป็นสวรรค์ของนักดำน้ำ และยังเป็นที่เที่ยวกระบี่ที่มีชื่อเสียงไปทั่วโลกอีกด้วย เพราะมีหาดทรายขาวละเอียด น้ำทะเลใสสะอาด สิ่งมีชีวิตใต้ท้องทะเลยังมีความอุดมสมบูรณ์ค่ะ ซึ่ง หมู่เกาะพีพี ประกอบด้วย 6 เกาะ คือ เกาะพีพีดอน เกาะพีพีเล เกาะยูง เกาะไม้ไผ่ เกาะบิดะนอก และเกาะบิดะใน')
        st.write('&nbsp;&nbsp;&nbsp;  สำหรับใครที่อยากไปนอนค้างชิลๆ ที่หมู่เกาะพีพี สามารถไปได้ที่ เกาะพีพีดอน ค่ะ เพราะที่นี่เป็นเกาะศูนย์รวม ที่มีท่าเรือ ที่พัก ร้านอาหารต่างๆ และเป็นเกาะที่ใหญ่ที่สุดในหมู่เกาะพีพีนั่นเอง ')
        st.image('https://www.krabipao.go.th/files/com_travel/2020-07_b6bbce1ec3c4e5b.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลอ่าวนาง อำเภอเมืองกระบี่ จังหวัดกระบี่
พิกัด : https://goo.gl/maps/AJbJedZ6Uj6YrdsAA
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตามรอบเรือนำเที่ยว
โทร : -
เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('เกาะห้อง')
        st.write('&nbsp;&nbsp;&nbsp; เกาะห้อง อยู่ในเขต อุทยานแห่งชาติธารโบกขรณี ประกอบด้วยเกาะน้อยใหญ่ มีเกาะห้องเป็นเกาะที่ใหญ่ที่สุด ทั่วไปเป็นเขาหินปูน น้ำทะเลใส หาดทรายขาว มีแนวปะการังทั้งน้ำตื้นและน้ำลึกค่ะ ความโดดเด่นไม่เหมือนใครของเกาะห้องอยู่ตรงที่ ชายหาดด้านหน้าเกาะที่โค้งเกือบจะเป็นครึ่งวงกลม น้ำทะเลที่นี่เป็นสีเทอคอยส์ และบนเกาะยังมีเส้นทางเดินสำหรับศึกษาธรรมชาติ นอกจากนี้ยังสามารถพายเรือคายัครอบๆ เกาะห้องได้อีกด้วยค่ะ')
        st.image('https://teawlay.com/medias/hong-island-krabi-1.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลหนองทะเล อำเภอเมืองกระบี่ จังหวัดกระบี่
พิกัด : https://goo.gl/maps/roKTVrwAHrPqCMLq7
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตามรอบเรือนำเที่ยว
โทร : -
เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('5.อุทยานแห่งชาติหมู่เกาะลันตา')
        st.write('&nbsp;&nbsp;&nbsp;  อุทยานแห่งชาติหมู่เกาะลันตา ประกอบด้วยเกาะต่างๆ ที่สำคัญ ได้แก่ เกาะลันตาน้อย เกาะลันตาใหญ่ เกาะตะละเบ็ง และเกาะใกล้เคียง รวมไปถึง หมู่เกาะห้า เกาะรอกนอก เกาะรอกใน และ เกาะไหง ค่ะ ซึ่งแต่ละเกาะก็จะมีเอกลักษณ์ และที่เที่ยวแตกต่างกันไป')
        st.write('&nbsp;&nbsp;&nbsp;   เกาะที่พลาดไม่ได้ที่จะแวะไปเที่ยวอุทยานฯ ก็คือ เกาะลันตาใหญ่ ที่เป็นที่ตั้งของอุทยานฯ โดยที่นี่จะมีทั้งร้านค้า ร้านอาหาร และที่พักมากมาย มีสถานที่ท่องเที่ยวที่น่าไปเช็คอินอย่าง จุดชมวิวแหลมโตนด ประภาคาร หาดคอกวาง หาดโละบารา หาดพระแอะ อีกทั้งตอนปลายสุดของแหลมเป็นที่ตั้งของ เกาะหม้อ ซึ่งเป็นจุดดำดูปะการังน้ำลึกค่ะ ฤดูท่องเที่ยวจะอยู่ระหว่างเดือนพฤศจิกายน-พฤษภาคม ใครอยากไปเที่ยวแนะนำว่าไปช่วงนี้อากาศดีสุดๆ')
        st.image('http://krabi.thailocallink.com/files/com_travel/2016-10_2bd2ea39592cbcc.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : อำเภอเกาะลันตา จังหวัดกระบี่
พิกัด : https://goo.gl/maps/rvxLRGhbVuir3haXA
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตามรอบเรือนำเที่ยว
โทร : 0-7565-6576
เว็บไซต์ : https://www.facebook.com/อุทยานแห่งชาติหมู่เกาะลันตา
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('น้ำตกร้อนคลองท่อม')
        st.write('&nbsp;&nbsp;&nbsp; น้ำตกร้อนคลองท่อม น้ำพุร้อนธรรมชาติที่มีอุณหภูมิประมาณ 40-50 องศาเซลเซียส น้ำตกร้อนนี้ เกิดจากแหล่งแร่น้ำร้อนใต้ดินที่ซึมขึ้นมาจากผิวดินลักษณะเป็นชั้นคล้ายน้ำตกเล็กๆ Unseen ไม่เบาค่ะ บางช่วงมีควันกรุ่นและคราบหินปูนธรรมชาติทำให้เกิดทัศนียภาพสวยงามแปลกตา เฉพาะบริเวณที่ลดระดับเกิดเป็นลักษณะคล้ายชั้นน้ำตกเล็กๆ โดยจะมีแอ่งน้ำเล็กๆ คล้ายอ่างอาบน้ำหลายแอ่ง เราสามารถลงเล่นน้ำหรือแช่ตัวได้แบบออนเซ็นธรรมชาติที่ญี่ปุ่นเลยทีเดียว')
        st.image('https://tatapi.tourismthailand.org/tatfs/Image/CustomPOI/Picture/P03013290_1.jpeg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : 164/1 หมู่ 4 ตำบลคลองท่อมเหนือ อำเภอคลองท่อม จังหวัดกระบี่
พิกัด : https://goo.gl/maps/JbtDAnECiWTCjjGn9
เปิดให้เข้าชม : 08.00-18.00 น.
โทร : -
เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('8.สระมรกต')
        st.write('&nbsp;&nbsp;&nbsp;       สระมรกต เป็นสระน้ำที่เกิดขึ้นตามธรรมชาติ น้ำมีสีเขียวมรกต มาจากธารน้ำอุ่น ที่เป็นเป็นน้ำพุร้อน มีอุณหภูมิประมาณ 30-50 องศาเซลเซียส ค่ะ สามารถลงเล่นน้ำได้ ที่สระมรกตนั้นมีน้ำที่มีสีเขียวก็เพราะแบคทีเรีย และสาหร่ายในน้ำซึ่งจะทำให้น้ำมีสีต่างๆ แตกต่างกัน ภายในมีสะพานไม้ให้เดินเล่น ถ่ายรูปสวยๆ นอกจากนี้ยังเป็นเส้นทางเดินธรรมชาติ และเป็นที่อยู่ของนกนานาชนิดอีกด้วย')
        st.image('https://www.krabipao.go.th/files/com_travel/2020-07_61686b12b8328fe.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : 164/1 หมู่ 4 ตำบลคลองท่อมเหนือ อำเภอคลองท่อม จังหวัดกระบี่
พิกัด : https://goo.gl/maps/JbtDAnECiWTCjjGn9
เปิดให้เข้าชม : 08.00-18.00 น.
โทร : -
เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('9.ท่าปอมคลองสองน้ำ')
        st.write('&nbsp;&nbsp;&nbsp;    ท่าปอมคลองสองน้ำ อีกหนึ่งที่เที่ยวในกระบี่ ที่พลาดไม่ได้เลยทีเดียวค่ะ ที่นี่เป็นธารน้ำที่มีความมหัศจรรย์ทางธรรมชาติ เนื่องจากมีทั้งช่วงที่น้ำจืดและช่วงที่มีน้ำกร่อย ตามช่วงน้ำขึ้น-ลง ภายใต้ลำธารที่ใสสะอาด น้ำในคลองก็จะใสราวกับกระจก สีเขียวอมฟ้า สวยงามมากๆ อีกทั้งยังอุดมไปด้วยหญ้าทะเล และฝูงปลาตัวเล็ก ที่นี่เป็นแหล่งศึกษาเชิงนิเวศวิทยาอย่างดี และมีความหลากหลายทางธรรมชาติมากอีกที่หนึ่งในไทยเลยทีเดียว')
        st.image('https://sls-prod.api-onscene.com/partner_files/trueidintrend/7089/IMG_5187_0.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลเขาคราม อำเภอเมืองกระบี่ จังหวัดกระบี่
พิกัด : https://goo.gl/maps/Yd2Ti1Xm2t1BPPK4A
เปิดให้เข้าชม : 09.00-18.00 น.
โทร : -
เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('10.พายคายัค อ่าวท่าเลน')
        st.write('&nbsp;&nbsp;&nbsp;  กระบี่ยังคงมีความสมบูรณ์ของธรรมชาติป่าชายเลนอยู่มาก ทำให้ที่นี่ก็เป็นอีกหนึ่งกิจกรรมที่พลาดไม่ได้ในการมาเที่ยวกระบี่ก็คือมาพายคายัค ที่ อ่าวท่าเลน นั่นเอง ที่นี่มีเส้นทางพายเรือชมธรรมชาติ พร้อมไปกับการชมวิวป่าโกงกางที่ยังคงสมบูรณ์ค่ะ')
        st.write('&nbsp;&nbsp;&nbsp; ')
        st.image('http://www.krabiview.com/th/wp-content/uploads/2015/08/kayaking-thalane-krabi-2.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : หมู่ 3 ตำบลเขาทอง อำเภอเมืองกระบี่ จังหวัดกระบี่
พิกัด : https://goo.gl/maps/rmotXq7CTp4xbWDMA
เปิดให้เข้าชม : 08.00-17.00 น.
โทร : -
เว็บไซต์ : -
        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('อ้างอิงค์ https://travel.trueid.net/detail/3wN2XMgdjb8')

if selected_option == "ประจวบคีรีขันธ์":
    travel9 = st.sidebar
    if travel9:
        st.markdown(
            f"""
                                                                                                  <style>
                                                                                                  .stApp {{
                                                                                                      background-image: url("https://i.pinimg.com/originals/f5/ec/ea/f5eceaffa7c5d1a54a7623c1b55531e9.jpg");
                                                                                                      background-attachment: fixed;
                                                                                                      background-size: cover;
                                                                                                      /* opacity: 0.3; */
                                                                                                  }}
                                                                                                  </style>
                                                                                                  """,
            unsafe_allow_html=True)
        st.title('สถานที่ท่องเที่ยวใน ประจวบคีรีขันธ์')
        st.header('จังงหวัด "ประจวบคีรีขันธ์" มีผู้าเข้าชมเฉี่ยต่อปี กระบี่ 217,526 คน ในปี ค.ศ.2023 และมีรายได้จากการท่องเที่ยว  ประจวบคีรีขันธ์ 854 ล้านบาท')

        st.write('1.หาดหัวหิน')
        st.write('&nbsp;&nbsp;&nbsp; เริ่มด้วย หาดหัวหิน ชายหาดฮ็อตฮิตตลอดกาล ที่ไม่ว่าใครก็ต้องไปเช็คอินที่นี่ก่อนเป็นที่แรกเมื่อมาเที่ยว ประจวบคีรีขันธ์ ขึ้นชื่อว่าเป็นเมืองตากอากาศมาเป็นเวลานาน ตามริมชายหาดหัวหินจึงมีโรงแรม ร้านอาหารสวยๆ มากมายให้ทุกคนได้ดื่มด่ำกับ ทะเลหัวหิน กันค่')
        st.write('&nbsp;&nbsp;&nbsp; อีกทั้งที่นี่ยังเป็นจุดศูนย์รวมของกิจกรรมทางน้ำต่างๆ ไม่ว่าจะเป็น บานาน่าโบ๊ต เจ็ทสกี รวมไปถึงขี่ม้าชมชายหาดชิลๆ ด้วยเช่นกัน')
        st.image('https://www.talon.travel/wp-content/uploads/talon-17-11-2020-2.png', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : อำเภอหัวหิน จังหวัดประจวบคีรีขันธ์ 
พิกัด : https://goo.gl/maps/bKf2CkcYdcopnAPh8 
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
โทร : -
เว็บไซต์ : -
                ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('2.หาดเขาเต่า')
        st.write('&nbsp;&nbsp;&nbsp;   หนีความวุ่นวายจากหัวหิน มาเดินเล่นที่ หาดเขาเต่า กันสักหน่อย ในบริเวณนี้จะมีที่พัก และร้านอาหารน้อยกว่าที่ชายหาดหัวหินค่ะ แต่ให้ความเป็นส่วนตัว และเงียบสงบมากกว่า เหมาะแก่การมาเดินหาด เล่นน้ำ พักผ่อนสบายๆ สำหรับใครที่อยากเข้าวัดไหว้พระ สามารถไปไหว้พระที่ วัดถ้ำเขาเต่า ซึ่งตั้งอยู่ห่างจากตัวหาดประมาณ 1 กิโลเมตร เท่านั้นค่ะ')
        st.image('https://static.estopolis.com/article/5d157f1d15f0207d57e470a0_5d158ec315f0203ed16ac653.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : หมู่บ้านเขาเต่า ตำบลหนองแก อำเภอหัวหิน จังหวัดประจวบคีรีขันธ์
พิกัด : https://goo.gl/maps/LDitwoMdNTnGBNyZ9 
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
โทร : -
เว็บไซต์ : -

                        ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('สถานีรถไฟหัวหิน')
        st.write('&nbsp;&nbsp;&nbsp;   ถ้าถามถึง สถานีรถไฟที่สวยที่สุดในประเทศไทย หนึ่งในนั้นก็ต้องมี สถานีรถไฟหัวหิน แน่นอนค่ะ ด้วยเอกลักษณ์ที่ไม่เหมือนใครของ พลับพลาพระมงกุฎเกล้าฯ พลับพลาทรงจตุรมุข ซึ่งเดิมตั้งอยู่ที่บริเวณพระราชวังสนามจันทร์ จังหวัดนครปฐม แต่หลังจากสิ้นรัชกาลที่ 6 การรถไฟแห่งประเทศไทยจึงย้ายตัวพลับพลามาไว้ที่ สถานีรถไฟหัวหิน แห่งนี้เพื่อระลึกถึงพระมหากรุณาธิคุณของพระองค์ท่าน ที่นี่จึงกลายเป็นแลนด์มาร์คยอดฮิตของหัวหินที่คนต้องมาถ่ายรูปด้วยค่ะ')
        st.image('http://www.juth.net/wp-content/uploads/2016/09/JUTHNET_HuaHinStation_Feature-725x375.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลหัวหิน อำเภอหัวหิน จังหวัดประจวบคีรีขันธ์
พิกัด : https://goo.gl/maps/CpPdSuQ1NK7ciXuU8 
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
โทร : -
เว็บไซต์ : -
                                ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('4.ซิเคด้า มาร์เก็ต')
        st.write('&nbsp;&nbsp;&nbsp;  ช่วงวันหยุดสุดสัปดาห์ก็ไปเดินเล่นแก้เบื่อกันที่ ตลาดชิเคด้า หรือ ตลาดจั๊กจั่น ศูนย์รวมของแต่งบ้าน เสื้อผ้าแฟชั่น งานศิลปะ และงานแฮนด์เมดเก๋ๆ กับบรรยากาศแสนคึกคักในยามค่ำคืน บางครั้งจะมีการแสดงดนตรีสด และการแสดงเปิดหมวกต่างๆ ที่มาสร้างสีสันให้กับการเดินช้อปปิ้งค่ะ')
        st.image('https://www.bloggang.com/data/morkmek/picture/1338464280.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : 83/159 ซอยหัวถนน 21 ตำบลหนองแก อำเภอหัวหิน จังหวัดประจวบคีรีขันธ์
พิกัด : https://g.page/CicadaMarket?share  
เปิดให้เข้าชม : วันศุกร์ เสาร์ และ วันอาทิตย์ 16.00-23.00 น.
โทร : 09-9669-7161
เว็บไซต์ : https://www.facebook.com/cicadamarket
                                ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('5.ตลาดน้ำหัวหินสามพันนาม')
        st.write('&nbsp;&nbsp;&nbsp;  เที่ยวสไตล์ย้อนยุคกันหน่อยๆ ที่ ตลาดน้ำหัวหินสามพันนาม ตลาดน้ำย้อนยุคบรรยากาศรัตนโกสินทร์ ช่วงสมัยรัชกาลที่ 6 ค่ะ ที่นี่มีร้านรวงทั้งหมดกว่า 200 ร้านค้า และเรือสินค้ากว่า 50 ลำ ที่มาพร้อมกับสินค้าต่างๆ มากมาย ไม่ว่าจะเป็นอาหาร เครื่องดื่ม ขนม เสื้อผ้า สินค้าแฮนด์เมด')
        st.image('http://f.ptcdn.info/343/037/000/nxqdyzx48yPyUiM3hEo-o.jpg', width=700)
        st.text('\n')
        st.text('''

ที่อยู่ : ตำบลทับใต้ อำเภอหัวหิน จังหวัดประจวบคีรีขันธ์
พิกัด : https://goo.gl/maps/ZgAj91gbVBHiLZAK6   
เปิดให้เข้าชม : 10.00-16.00 น.
โทร : 08-9080-5942
เว็บไซต์ : https://www.facebook.com/samphannam
                                ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('6.หาดเขาตะเกียบ')
        st.write('&nbsp;&nbsp;&nbsp; หาดเขาตะเกียบ แหล่งพักผ่อนอีกแห่งหนึ่งของหัวหินที่ยังคงความสวยงาม และมีที่พักมากมายเลยค่ะ ชายหาดที่นี่มีความยาวประมาณ 1.5 กิโลเมตร ลักษณะเด่นของชายหาดแห่งนี้คือ ภูเขาที่ยื่นออกมาจากชายหาด โดยมี พระพุทธรูปปางห้ามสมุทรองค์ใหญ่ หันหน้าออกสู่ทะเล ประดิษฐานอยู่บนนั้นนั่นเองค่ะ')
        st.image('https://www.matichon.co.th/wp-content/uploads/2019/08/BF376BDF-9593-4834-A160-5D7ACE99BD3C1.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : อำเภอหัวหิน จังหวัดประจวบคีรีขันธ์
พิกัด : https://goo.gl/maps/hcxot7jLe4JTdhsD6  
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
โทร : -
เว็บไซต์ : -
                                ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('7.สวนสนประดิพัทธ์')
        st.write('&nbsp;&nbsp;&nbsp;  สวนประดิพัทธ์ ถือเป็นชายหาดที่เงียบสงบ และสะอาดสะอ้านที่สุดในอำเภอหัวหินค่ะ เพราะอยู่ในการดูแลของกองทัพบก ซึ่งเปิดให้พวกเราได้เข้าไปเดินเล่น ชมวิวสวยๆ ของชายหาด นอกจากนี้ยังมีร้านอาหาร คาเฟ่ และบ้านพักริมทะเลเพื่อรองรับนักท่องเที่ยวที่ตั้งใจจะนอนค้างกันที่นี่ด้วยเช่นกัน')
        st.image('https://www.huahin.go.th/new/tmp/e4d149ef9a63b5ff362d8844895a51d2.jpg', width=700)
        st.text('\n')
        st.text('''

ที่อยู่ : ถนนเพชรเกษม ตำบลหนองแก อำเภอหัวหิน จังหวัดประจวบคีรีขันธ์
พิกัด : https://goo.gl/maps/3knPMuvRV53R1vRr6 
เปิดให้เข้าชม : 06.00-23.00 น.
โทร : -
เว็บไซต์ : -

                                ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('8.น้ำตกป่าละอู')
        st.write('&nbsp;&nbsp;&nbsp;  แม้หัดหินจะมีชายหาดสวยให้ได้เที่ยวกัน แต่ก็มีน้ำตกสวยที่พลาดไม่ได้เช่นกันค่ะที่ น้ำตกป่าละอู ตั้งอยู่ทางตอนใต้ของ อุทยานแห่งชาติแก่งกระจาน ห่างจากตัวเมืองหัวหินประมาณ 60 กิโลเมตร ใกล้หน่วยพิทักษ์อุทยานแห่งชาติที่ กจ.3 (ห้วยป่าเลา) เป็นน้ำตกขนาดใหญ่ มีความสูง 15 ชั้น และในชั้นที่ 7 จะมีแอ่งน้ำใหญ่ท่ามกลางป่าร่มรื่น ซึ่งเป็นชั้นที่สวยที่สุดในบรรดา 15 ชั้น มีบรรยากาศเงียบสงบ และผืนป่าที่อุดมสมบูรณ์ ')
        st.image('https://www.huahin.go.th/new/files/com_travel/2019-07_c1f04bd2c1a195d.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลห้วยสัตว์ใหญ่ อำเภอหัวหิน จังหวัดประจวบคีรีขันธ์
พิกัด : https://goo.gl/maps/wZtFaWQrgVCwwgEu8  
เปิดให้เข้าชม : 08.00-16.00 น.
โทร : -
เว็บไซต์ : -
                                ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('9.อุทยานแห่งชาติน้ำตกห้วยยาง')
        st.write('&nbsp;&nbsp;&nbsp;  อุทยานแห่งชาติน้ำตกห้วยยาง เป็นผืนป่าที่มีพันธุ์ไม้และสัตว์ป่าหลายชนิด รวมถึงเป็นที่ตั้งของ น้ำตกห้วยยาง น้ำตกขนาดใหญ่ 7 ชั้น ที่มีทัศนียภาพที่สวยงามต่างกัน แต่ชั้นที่สวยที่สุดของที่นี่คือ ชั้น 5 เพราะจะเห็นวิวของน้ำตกสูงถึง 15 เมตรไหลลงมาจากหน้าผาอย่างสวยงาม แถมยังมีแอ่งน้ำให้เล่นด้วยเช่นกันค่ะ')
        st.image('https://s359.kapook.com/pagebuilder/79cc25b5-c25d-4ba1-8213-68b48f5db094.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : หมู่ 11 ตำบลห้วยยาง อำเภอทับสะแก จังหวัดประจวบคีรีขันธ์
พิกัด : https://goo.gl/maps/DUyyJ5b44GxrHExJ7 
เปิดให้เข้าชม : 08.00-16.30 น.
โทร : 08-4701-2795
เว็บไซต์ : https://www.facebook.com/Huaiyang
                                ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('10.หาดทับสะแก')
        st.write('&nbsp;&nbsp;&nbsp;   หาดทับสะแก ชายหาดที่เงียบสงบ แม้จะไม่มีกิจกรรมมากเท่ากับหาดชื่อดังอื่นๆ ในประจวบคีรีขันธ์ แต่นั่นก็เป็นเสน่ห์ที่ทำให้ที่นี่เหมาะกับการเดินเล่น นั่งเล่นชิลๆ พักใจจากความวุ่นวายสุดๆ จุดถ่ายรูปสวยๆ ที่ห้ามพลาดเลยก็คือ สะพานไม้ที่ยื่นออกไปกลางทะเล สามารถไปชมวิวสวยๆ โดยเฉพาะช่วงพระอาทิตย์ตกดิน บอกเลยว่าโรแมนติกสุดๆ แถมฝั่งตรงข้ามชายหาดก็ยังมีภาพสตรีทอาร์ตให้ไปถ่ายรูปเท่ๆ อีกด้วยนะ')
        st.image('https://lh5.googleusercontent.com/p/AF1QipOnYdEWiX4FkMhHzhtWxtzgauvFire4snr1i09C=w592-h404-n-k-no-v1', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลทับสะแก อำเภอทับสะแก จังหวัดประจวบคีรีขันธ์
พิกัด : https://goo.gl/maps/qkRAdDW4TPjkURhy7    
เปิดให้เข้าชม : สามารถเที่ยวชมได้ตลอดทั้งวัน
โทร : -
เว็บไซต์ : -

                                ''')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('อ้างอิงค์ https://travel.trueid.net/detail/r5DEDgN9Q2ao')

if selected_option == "หนองคาย":
    travel10 = st.sidebar
    if travel10:
        st.markdown(
            f"""
                                                                                                          <style>
                                                                                                          .stApp {{
                                                                                                              background-image: url("https://img.freepik.com/free-vector/glowing-rays-background-orange-color_1017-26180.jpg");
                                                                                                              background-attachment: fixed;
                                                                                                              background-size: cover;
                                                                                                              /* opacity: 0.3; */
                                                                                                          }}
                                                                                                          </style>
                                                                                                          """,
            unsafe_allow_html=True)
        st.title('สถานที่ท่องเที่ยวใน หนองคาย')
        st.header('จังงหวัด "หนองคาย" มีผู้าเข้าชมเฉี่ยต่อปี  หนองคาย 231,243 คน ในปี ค.ศ.2023 และมีรายได้จากการท่องเที่ยว  หนองคาย 526 ล้านบาท')

        st.write('1.วัดโพธิ์ชัย')
        st.write('&nbsp;&nbsp;&nbsp; วัดโพธิ์ชัย เป็นวัดเก่าแก่ที่มีความสำคัญประจำจังหวัดหนองคายค่ะ เป็นที่ประดิษฐานของหลวงพ่อพระใสอันศักดิ์สิทธิ์ ซึ่งชาวหนองคายและจังหวัดใกล้เคียง ต่างพากันเดินทางมาสักการะ เพราะเป็นพระพุทธรูปคู่บ้านคู่เมืองที่มีตำนานในประวัติศาสตร์เกี่ยวข้องกับทั้งชาวไทยและชาวลาว และวัดโพธิ์ชัยยังเป็นวัดที่มีโบสถ์สวยงามอีกด้วย ใครไปเที่ยวหนองคาย ห้ามพลาดที่จะไปสักการะกันนะ')
        st.image('https://www.watportal.com/th/file/get/file/201812201e5b69504de7cc2622ab145dda792bc1084532.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ถนนหนองคาย-โพนพิสัย ตำบลในเมือง อำเภอเมือง จังหวัดหนองคาย
พิกัด : https://goo.gl/maps/X5M2rW4Y2rimVJ1KA
เปิดให้เข้าชม : 08.00 น. – 16.30 น.
โทร : 09-2691-8091
เว็บไซต์ : -
                ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('2.ตลาดท่าเสด็จ')
        st.write('&nbsp;&nbsp;&nbsp; ตลาดท่าเสด็จ เป็นแหล่งซื้อขายผลิตภัณฑ์ชุมชน หรือสินค้า OTOP ค่ะ นักท่องเที่ยวส่วนใหญ่มักจะมาหาซื้อสินค้าพื้นเมือง และของที่ระลึกของจังหวัดหนองคายแล้วที่นี่ นอกจากนี้ตลาดท่าเสด็จยังอยู่ติดริมแม่น้ำโขงอีกด้วย สามารถมองเห็นฝั่งประเทศลาว มาเดินเล่นชิลๆ ริมแม่น้ำก็ยังได้ และในวันหยุดตลาดท่าเสด็จ ก็ยังกลายเป็นถนนคนเดินในช่วงเย็นค่ะ บอกเลยว่าคึกคักสุดๆ เลยล่ะค่า')
        st.image('https://sites.google.com/site/pearpontiwa/_/rsrc/1469111694440/home/tlad-tha-sedc/140908110618985.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลในเมือง อำเภอเมืองหนองคาย จังหวัดหนองคาย
พิกัด : https://goo.gl/maps/8ribT66US8EFfT1v6
เปิดให้เข้าชม : 09.00-18.00 น.
โทร : -
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('3.ศาลาแก้วกู่')
        st.write('&nbsp;&nbsp;&nbsp; ศาลาแก้วกู่ หรือวัดแขกเป็นเป็นพิพิธภัณฑ์กลางแจ้งที่แปลกตา และสวยงามมากค่ะ เป็นลานที่มีรูปปั้นเรื่องราวทางศาสนาไว้มากมาย ซึ่งอยู่ห่างจากตัวเมืองหนองคาย 3 กิโลเมตร บอกเลยว่าใครเป็นสายอาร์ท ชื่นชอบในงานศิลปะ รักงานปั้นต่างๆ จะต้องชอบที่นี่แน่นอนค่ะ ปล.รูปปั้นเจ้าแม่นาคีเค้าก็มีที่นี่นะ ! ถ้าอยากรู้ต้องมาตามหากันแล้วล่ะค่า')
        st.image('https://www.paiduaykan.com/travel/wp-content/uploads/2020/01/2-DEW_6959-800x533.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ :ตำบลวัดธาตุ อำเภอเมืองหนองคาย จังหวัดหนองคาย
พิกัด : https://goo.gl/maps/TDkPcctXTg9Qo7zNA
เปิดให้เข้าชม : 09.00-18.00 น.
โทร : 09-5647-2111
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('4.หาดจอมมณี')
        st.write('&nbsp;&nbsp;&nbsp; บอกเลยว่าถึงแม้ภาคอีสานจะไม่มีทะเล แต่ที่จังหวัดหนองคายเค้ามี หาดจอมมณี หรือที่เรียกกันว่า พัทยาอีสาน นั่นเอง ที่นี่จะเป็นหาดทรายริมแม่น้ำโขง ใกล้กับสะพานมิตรภาพไทย – ลาว ถือว่าเป็นอีกหนึ่งสถานที่พักผ่อนของชาวหนองคายค่ะ และเป็น Unseen ของจังหวัดหนองคายอีกด้วย เพราะที่หาดจอมมณีจะมีในช่วงหน้าแล้งเท่านั้นค่ะ ช่วงที่ดีที่สุดที่ควรไปเช็คอินหาดจอมมณีก็คือ เดือนเมษายนค่ะ')
        st.image('https://woodychannel.com/wp-content/uploads/2015/02/jommanee-750x386.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : บ้านจอมมณี หมู่ที่ 1 ตำบลมีชัย อำเภอเมือง จังหวัดหนองคาย
พิกัด : https://goo.gl/maps/3Uipqu88rSvs1g7cA 
เปิดให้เข้าชม : สามารถเข้าชมได้ตลอดทั้งวัน
โทร : -
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('5.พระธาตุบังพวน')
        st.write('&nbsp;&nbsp;&nbsp; อีกหนึ่งสถานทีศักดิ์สิทธิ์ประจำจังหวัดหนองคายค่ะ พระธาตุบังพวน เป็นพระธาตุเจดีย์ที่เก่าแก่และสำคัญของชาวหนองคาย และทั่วทั้งภาคอีสานค่ะ ประดิษฐานอยู่ ณ บ้านพระธาตุบังพวน มีวิหาร 3 หลัง อุโบสถ 1 หลัง สระน้ำ และบ่อน้ำโบราณ บรรยากาศภายในวัดร่มรื่นมากค่ะ มีสนามหญ้าที่ทำให้น่าเดินชม ใครที่ชื่นชอบสถานที่สำคัญทางศาสนา ห้ามพลาดที่จะไปสักการะกันนะค')
        st.image('https://muangboranmuseum.com/wp-content/uploads/2018/12/north-east.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : 172 หมู่ 3 ตำบลพระธาตุบังพวน อำเภอเมือง จังหวัดหนองคาย
พิกัด : https://goo.gl/maps/PsY1RCwRDJbwghWJ6
เปิดให้เข้าชม : 08.00-16.00 น
โทร : -
เว็บไซต์ : -

                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('6.วัดผาตากเสื้อ')
        st.write('&nbsp;&nbsp;&nbsp; อีกหนึ่งแลนด์มาร์คสุดฮิตของจังหวัดหนองคาย นั่นก็คือ วัดผาตากเสื้อ ค่ะ ซึ่งมีจุดชมวิวสกายวอร์คแห่งแรกในประเทศไทย ! ตั้งอยู่ในอำเภอสังคมนี่เองค่ะ เราสามารถไปชมวิวมุมสูงแบบ 180 องศาได้เลยทีเดียว มองไปจะเห็นแม่น้ำโขง สุดสายตา มีแต่สีเขียวสุดอุดมสมบูรณ์ แถมยังเป็นจุดชมวิวพระอาทิตย์ขึ้นและตกด้วยค่ะ บอกเลยว่าสวยสุดๆ ห้ามพลาดไปเช็คอินเด็ดขาดค่า')
        st.image('https://paikondieow.com/wp-content/uploads/2021/10/0-0.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลผาตั้ง อำเภอสังคม จังหวัดหนองคาย
พิกัด : https://goo.gl/maps/n8D88fe6d9Vz1JZU7
เปิดให้เข้าชม : 06.00-18.00 น
โทร : -
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('7.วังหนองบัวแดง')
        st.write('&nbsp;&nbsp;&nbsp; ')
        st.image('https://www.mustdoholiday.com/wp-content/uploads/2022/08/%E0%B8%AA%E0%B8%96%E0%B8%B2%E0%B8%99%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%97%E0%B9%88%E0%B8%AD%E0%B8%87%E0%B9%80%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%A7%E0%B9%83%E0%B8%99%E0%B9%84%E0%B8%97%E0%B8%A2-%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%95%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%97%E0%B8%A8-95.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : หมู่ที่ 7 หนองบ่อ ซอย 4 ตำบลปะโค อำเภอเมืองหนองคาย จังหวัดหนองคาย
พิกัด : https://goo.gl/maps/VzWhTiV1chn5rQHbA
เปิดให้เข้าชม : 07.00-17.00 น
โทร : 08-5757-1065
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('8.ภูห้วยอีสัน')
        st.write('&nbsp;&nbsp;&nbsp; อีกหนึ่งสถานที่ในจังหวัดหนองคายที่ไม่อยากให้พลาดเด็ดขาด ! ภูห้วยอีสัน เป็น Unseen ของจังหวัดหนองคายค่ะ จุดชมวิวทะเลหมอกที่สวยงามมาก ยิ่งถ้าไปตอนพระอาทิตย์ขึ้นจะเห็นแสงสีทองของพระอาทิตย์พาดกับทะเลหมอก แบบพาโนรามา มองออกไปสุดสายตาเป็นพื้นที่สีเขียว อุดมสมบูรณ์มากค่ะ หลงเสน่ห์กับที่นี่ได้ไม่ยากเลยจริงๆ เรารับรองได้ว่าใครไปแล้วต้องประทับใจ จนอยากกลับไปอีก')
        st.image('https://s.isanook.com/tr/0/ud/282/1412353/untitled-8_1.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลบ้านม่วง อำเภอสังคม จังหวัดหนองคาย
พิกัด : https://goo.gl/maps/USq97JciYeeg3CpQ7
เปิดให้เข้าชม : 08.00-19.00 น.
โทร : -
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('9.ภูผาดัก')
        st.write('&nbsp;&nbsp;&nbsp; อีกหนึ่งจุดชมวิวสวยๆ ของ หนองคาย ก็คือที่นี่ค่ะ ภูผาดัก เพราะเราจะสามารถชมวิวของทะเลหมอกได้อย่างสวยงามมากๆ รวมถึงยังเป็นจุดชมทะเลหมอกที่สูงที่สุดของหนองคายอีกด้วยนะคะ ซึ่งการจะเดินทางขึ้นไปนั้นก็ต้องอาศัยความชำนาญ เพราะฉะนั้นถึงต้องมีผู้เชี่ยวชาญนำทางตลอดๆ ค่ะ ส่วนวิวของด้านบนนั้นก็คือ ทะเลหมอกที่อยู่ริมลำน้ำโขง นั่นเอง บอกเลยว่าคุ้มค่าแน่นอน')
        st.image('https://img.kapook.com/u/2017/Tanapol/travel/august/puphaduk/f1.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลบ้านม่วง อำเภอสังคม จังหวัดหนองคาย
พิกัด : https://goo.gl/maps/QhoWJ2bJdbJkT4cdA    
เปิดให้เข้าชม : สามารถเข้าชมได้ตามเวลาเปิดปิดของสถานที่
โทร : -
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')

        st.write('10.ถ้ำดินเพียง')
        st.write('&nbsp;&nbsp;&nbsp; แน่นอนว่ามาหนองคาย ซึ่งเป็นเมืองแห่งพญานาค เราก็ต้องมาเช็คอินกันที่ ถ้ำดินเพียง หรือที่ชาวบ้านเรียกกันว่า ถ้ำพญานาค ตั้งอยู่ในวัดถ้ำศรีมงคลค่ะ ตัวถ้ำจะมีลักษณะเป็นรูโพรง ที่แบ่งแยกซอยออกไปทั่วบริเวณถ้ำ ในถ้ำจะมีหินงอกหินย้อยกระจายอยู่รอบๆ และด้วยเสาหิน โพรงหินที่มีรูปทรงแปลกตา แต่ดูสวยงามมากจริงๆ ทำให้ถ้ำดินเพียงเป็นอีกหนึ่งสถานที่ท่องเที่ยวไฮไลท์ของจังหวัดหนองคายค่ะ')
        st.image('https://s.isanook.com/tr/0/rp/r/w728/ya0xa0m1w0/aHR0cHM6Ly9zLmlzYW5vb2suY29tL3RyLzAvdWQvMjgyLzE0MTQxMTMvMjU2MjAxMjlfMTkwMTI5XzAwMTkuanBn.jpg', width=700)
        st.text('\n')
        st.text('''
ที่อยู่ : ตำบลผาตั้ง อำเภอสังคม จังหวัดหนองคาย
พิกัด : https://goo.gl/maps/KghmztAd88P6Yk7aA
เปิดให้เข้าชม : 08.00-19.00 น.
โทร : -
เว็บไซต์ : -
                        ''')

        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('\n')
        st.text('อ้างอิงค์ https://travel.trueid.net/detail/oRay0VlMMQDR')

if selected_option == "คำนวนหารายจ่ายต่อคน":
    travel12 = st.sidebar
    if travel12:
        st.markdown(
            f"""
                                                                                                                  <style>
                                                                                                                  .stApp {{
                                                                                                                      background-image: url("https://i.pinimg.com/originals/3c/24/46/3c24462450c2a902bf7e18f3d9aada81.jpg");
                                                                                                                      background-attachment: fixed;
                                                                                                                      background-size: cover;
                                                                                                                      /* opacity: 0.3; */
                                                                                                                  }}
                                                                                                                  </style>
                                                                                                                  """,
            unsafe_allow_html=True)

        st.markdown(
            """
            <h1 style='text-align: center'>โปรแกรมคำนวนรายจ่ายต่อคน</h1>
            """,
            unsafe_allow_html=True
        )
        population = st.number_input("จำนวนนักท่องเที่ยว (คน) : ",)
        area = st.number_input("อยู่นานเท่าไร่ (วัน) :")
        x2 = st.button("calculate")
        if x2:
            calculator = st.write(f'รายจ่าของนักท่องเที่ยวรวมกันทั้งหมด (บาทโดยเฉลี่ย) : {population * 54000 * area:.2f} ')
            #st.write("จำนวนนักท่องเที่ยว / จำนวนรายได้ (ล้านบาท)")

        def load_house_data():
            return pd.read_excel('wp.xlsx')

        def save_model(model):
            joblib.dump(model, 'model.joblib')

        def load_model():
            return joblib.load('model.joblib')

        def generate_wedtest_data():
            rng = np.random.RandomState(0)
            n = 10
            x = np.round(100000000000 * rng.rand(n))  # จำนวนประชากร
            y = np.round(2500000 * rng.rand(n))  # พื้นที่
            df = pd.DataFrame({
                'ประชากรณ์ (คน) ': x,
                'รายได้เฉลี่ย (ล้านบาท) ': y
            })
            df.to_excel('wp.xlsx')

        generateb = st.button('generate wp.xlsx')
        if generateb:
            st.write('generating "wp.xlsx" ...')
            generate_wedtest_data()

        #loadb = st.button('load wp.xlsx')
        #if loadb:
         #   st.write('loading "wp.xlsx ..."')
          #  df = pd.read_excel('wp.xlsx', index_col=0)
           # st.dataframe(df)
            #fig, ax = plt.subplots()
           # df.plot.scatter(x='ประชากรณ์ (คน) ', y='รายได้เฉลี่ย (ล้านบาท) ')
            #st.pyplot(fig)

        chart = st.button('Chart Program')
        if chart:
            tab1, tab2 = st.tabs(["📈 กราฟ", "🗃 ตารางข้อมูล"])
            df = pd.read_excel('wp.xlsx', index_col=0)
            tab1.line_chart(df)
            tab2.write(df)